[
    {
        "price": "$352.50",
        "ratings": {
            "2 star": "3%",
            "1 star": "10%",
            "5 star": "65%",
            "4 star": "17%",
            "3 star": "5%"
        },
        "url": "http://www.amazon.com/dp/B01ETPUQ6E",
        "name": "Samsung Galaxy J7 No Contract Phone,  16GB ROM / 2GB RAM, 5.5 Inch - White - (Boost Mobile)",
        "reviews": [
            {
                "review_text": "I love this Samsung J7, since it is bigger than the s6 and s7, and as good as my old S5 (as compared in the images). I had no issues charging it or switching it over from old phone to this new phone - via a 4 minute phone call to Boostmobile. Yes, the S6 and S7 have -much- faster processors, but I do not need that for what I do... and so far, after 1 month of use, I absolutely love this phone!. The phone feels great, responds quickly, and looks freaking awesome. Pros: -Great price -AFFORDABLE! -Bigger than most other phones available -Great quality screen Cons: -2 bottom buttons- on side of the main home button- DO NOT light up -Camera is not comparable to that of the S5, S6, and S7 -Overall quality does not feel as sturdy as the other models mentioned (Shell plastic is thinner). After one month of use, I rated this phone with 4 stars. I will be updating this review in about 6 months. REVIEW UPDATE: February 19, 2017 After eight (8) months of owning this phone, and 7 months since this original review, I am back today to continue my review as promised. I am doing 2 things for those of you who are reading this review for the first time: 1) I have added a star to make this a 5 star review! 2) I will explain why I have decided to come back to add this star to my review. Let me clarify that since reviewing this, I have purchased a second one for my wife. I will also list what items I purchased it along with: Mr Shield Tempered Glass Screen Protector for Samsung Galaxy J7 [Will Not Fit For 2016 Version] - 2-Pack Samsung EVO 64GB Micro SDXC Memory Card with Adapter up to 48/MB/s (MB-MP64DA/AM) Phonelicious SAMSUNG Galaxy J7 Case(Boost,Virgin,TMobile,Metro PCS)Slim Fit Heavy Duty Ultimate Drop Protection Rugged Cover with Screen Protector & Stylus (Navy Blue Matte) Of course, purchasing a case, the Screen protector, and a good quality memory card may also influence how this product has performed. This phone continues to work as expected, and has delivered so far. I feel my investment on this phone has paid off, and my money has been worth. Being a somewhat frugal shopper, I thought I would give this phone a try to since it's price was reasonable for what I was getting. My 1 year old (who is now 18 months) has used and abused this phone. He has thrown it on the floor dozens of times, and has scratched, as well chewed on it. What has happened to the phone so far? - It has gained a large crack, on the screen protector. The phone is still working as it did 8 months ago, and the cheap items I purchased to protected have taken quite the toll. I had originally mentioned that the phone felt \"cheap\", and the thin plastic that it is made out of, is certainly noticeable compared to the quality of the S5, and other S series for that matter. Given that this phone has performed well, continues to deliver, and has outlasted quite some abuse, I made the judgement to give this phone the extra star, since this is a great product to my standards. I plan to come back in June, and review this item again after a full year of use!",
                "review_rating": "5.0 ",
                "review_header": "Best phone I have owned with Boostmobile!",
                "review_comment_count": "",
                "review_author": " JLO",
                "review_posted_date": "19 Jul 2016"
            },
            {
                "review_text": "I bought this phone from boost Mobile website for 200 bucks. Of course its not as good as the s7, but if you don't wanna spend 700$ for a phone, then you can't go wrong with j7. Very good phone for the money. I already bought a couple spare batteries. Pros- Good price, good call quality, fast internet, good camera, good selfie camera, great display, perfect size, great for texting, Great battery life (leave it on power save mode), good speaker, 6.0 marshmallow is great, Cons- No LED notification light, incoming ring tone couple be louder.",
                "review_rating": "4.0 ",
                "review_header": "Very good phone for the money",
                "review_comment_count": "",
                "review_author": " Frankie",
                "review_posted_date": "13 May 2016"
            },
            {
                "review_text": "I love this Samsung J7. I couldn't afford the sticker price for the S6 or S7 (sticker shock!). Therefore; I opted for this which is scaled down in terms of processing/memory BUT it's much better quality than the phone I was using for my Boost Mobile account. I had no issues charging it or switching it over from old phone to this new phone - via my online account (I didn't have to talk to anybody to do this and it worked out just great). My hubby has the Samsung S6 which he saved/paid for upfront (no contract at Boost Mobile). Comparing my new J7 to his S6 - well; apples to oranges. His has 2 processors (a quad-core and an octa-core). This J7 has just the octa-core BUT for me is proving to be plenty of processing power along with the 2GB ROM. This was pretty comparable to the ZTE Warp Elite I've been using since January 2016 but I'd have to say that the Samsung is much faster - also that the screen response is so much better in this J7 model (even with the glass protection I placed on the screen). My hubby bought me this for my upcoming 60th birthday! GREAT present for me.....all mine! Thank you 'shopcelldeals' for selling this at a reasonable price that was affordable. Recommended.",
                "review_rating": "5.0 ",
                "review_header": "GORGEOUS phone .... I'm in love with it!",
                "review_comment_count": "",
                "review_author": " CmP",
                "review_posted_date": "06 May 2016"
            },
            {
                "review_text": "Awesome phone for the price. Face it, these are not the S7 phones but a cheaper version. I have no problem with them at all. Plenty of memory and large screen. I love the phone. You are getting a Marshmallow system which should keep me going for a couple of years. Boost mobile is like every other cell company. Hard to deal with on the phone but once the service is set up, no problems. Fast 4gLTE.",
                "review_rating": "5.0 ",
                "review_header": "Love the phone",
                "review_comment_count": "",
                "review_author": " Leesaa",
                "review_posted_date": "05 Jul 2016"
            },
            {
                "review_text": "I love this phone! Coming from the galaxy S3 for Boost this is a big jump in the right direction. $20 cheaper on amazon than the boost mobile site another plus.The battery last all day. That is while talking/texting using apps. It is two times bigger than the S3 but def worth it. The operating system is much faster and more responsive as well.",
                "review_rating": "5.0 ",
                "review_header": "Worth it.",
                "review_comment_count": "",
                "review_author": " TG",
                "review_posted_date": "19 Nov 2016"
            }
        ]
    },
    {
        "price": "",
        "ratings": {
            "2 star": "16%",
            "1 star": "19%",
            "5 star": "37%",
            "4 star": "19%",
            "3 star": "9%"
        },
        "url": "http://www.amazon.com/dp/B017HW9DEW",
        "name": "Motorola Moto G (3rd Generation) No Contract Phone (Virgin Mobile) - Retail Packaging",
        "reviews": [
            {
                "review_text": "I've had some time to kick my phone around (figuratively and literally), and I'm really impressed with this phone. It's value priced, but still very functional. I switched from a Samsung Galaxy SIII, and I feel that this was definitely an upgrade. While the Moto G3 has less memory (8GB) and storage (both internally, and it only supports up to 32GB SDHC micro card), the better processor makes a huge difference. I don't play games, but I do still run a fair number of productivity apps (the biggest being Polaris Office and TeamViewer) and they benefit greatly from the quad-core 1.4 GHz Cortex-A53 CPUs performance. The SIII would always hang up when running bigger applications, and would always freeze up when pulling up the SwiftKey keyboard. Some apps were almost unusable on the SIII because of these stutters and freezing (ProCapture was the biggest problem). I'm really impressed at how good the camera sensor is. The color, contrast, and brightness of the screen are also incredible. I've had better luck with 4G data, though I do notice a little less speed on Wifi after losing 5 gHz connectivity. The audio on the phone is an improvement, with the two larger speakers on the front of the device. Call clarity has been about as good as the SIII, in my tests. The phone construction is very solid, and seems very rugged in general. I was very happy with the upgrade, from the Galaxy SIII. For my purposes, it's a great phone. I like that it's water resistant, and it performs very well. My girlfriend ended up upgrading to the same phone, from an HTC Desire 816, and she's very happy with the performance boost. It's definitely NOT a flagship phone, and it's only suitable for lower-end or older games. This is not a power user phone, by any means. The smaller storage is probably the biggest limitation. While it hasn't greatly affected me, as I only have a few big apps, but it's definitely the most profound limitation of the phone. If you don't need the power and space of a flagship phone, but still want a very high-quality all-weather handset, I think this is an excellent option. The price jumps around, so if you wait around for a small discount, this is probably one of the better deals on the current phone market. It suits my needs very well, and - having survived being caught in a few big downpours - has been worth every penny. Sept. 2016 Update: For a few weeks, I was having problems with the SD Micro card becoming unmounted, or write problems on the SD Micro card. I assumed it was loosening up in the case (a problem I had with an older phone). Eventually it would refuse to re-mount, despite all attempts. It turned out the phone was having specific problems with the Samsung 32GB EVO Plus Class 10 Micro SDHC, that several other Moto G3 users experienced. I replaced it with a Class 6 Kingston card, and it's been working flawlessly ever since, without any noticeable decrease in read/write speeds.",
                "review_rating": "5.0 ",
                "review_header": "Excellent Phone For Value-Conscious Buyers & Intermediate Users - Rugged Weatherproof Design",
                "review_comment_count": "",
                "review_author": " Mr. Staack",
                "review_posted_date": "01 Aug 2016"
            },
            {
                "review_text": "This phone is one of the best I have had from Virgin Mobile, and know it would be better with T-Mobile or another GSM carrier with the extra specs those add. The camera is very nice for such a cheap phone, 13mp in the back, 5mp in the front. Works well in relatively low lighting and doesn't begin to look grainy until it's obviously much too dark, such as outside in the night with a fire for just light like the stone ages. Anyway, it's not the best camera, but definitely better than the LG Volt and LG G Stylo I had had before this one. The screen isn't brilliantly bright and crisp, but I promise it doesn't look horribly. The screen is big, but not too big, more comfortable than the LG G Stylo in my personal opinion, but if you like \"Phablets\", this is a big small, but you'd probably get used to it. The ram is only 1gb in the Virgin Mobile edition, and only 4.5gb of internal storage available to the user, even though it advertises 8gb. The other phone with the GSM carriers have 2gb of ram, and 16gb or storage with only 10gb or so left for the users accessibility. It comes with Lollipop, although I am sure the Marshmellow update wouldn't be long to hit considering it did hit the LG G Stylo quickly, and this phone is the 2015 successor of the Moto G lineups. The phone is able to be rooted, although I do not advise for it will void your warranty with Motorola and possibly Virgin Mobile, so you should know what you are doing. However, this should be brought up because Virgin Mobile carries a variety of cheap phones, but they are mostly LG. LG should not be rooted because they end up killing over and are touchy. Motorola is more laid back, and it should be noted so people know what they should and shouldn't if they are not experienced and want to try new things. Yes, this phone is water resistant, but not water proof. You can not swim with it and epect to use it under water. This is purely for accidents only. You can use this near water and if something splashes on it, it will be fine. You must remember to seal the back near the camera and the edges, or it will completely useless and you will lose your phone to water damage. The biggest con is the bit of crashes I have experienced on such little use. The play store crashes immediately when trying to type, and many other things end up crashing. This may not be a problem to all, but to me it was and should be noted. This does have an LED to those who care about that little helpful feature, however it is not able to be used for anything other than battery purposes, so you don't get anything very helpful from it. There is the feature Moto Display which shows your notifications on the screen in a specific way and there are settings for you to mess with. Over all this phone is a very great phone for the price and something that people can greatly appreciate for a low budget.",
                "review_rating": "5.0 ",
                "review_header": "Very good for Virgin Mobile.",
                "review_comment_count": "",
                "review_author": " Veronica Hale",
                "review_posted_date": "25 Apr 2016"
            },
            {
                "review_text": "So far, I'm very happy with this phone. The 8GB of internal memory is actually 4.54 gb of usable storage. I was worried that it wouldn't be sufficient for my needs but after installing my favorite apps I still have 2 gb left over. This phone replaced my 4 year old Galaxy S2. Comparing the two phones is like apples and oranges. Yes they are both phones but the Moto G does everything better than the S2 even if it has less internal memory (The S2 has 16GB) and lacks the NFC feature of the S2. The trade off is more than worth it. The Moto is faster, takes higher quality photos (in daylight) with a faster shutter speed, the speakerphone is really loud, and the battery life is amazing. After a full day of use my battery only dropped down to 70%. I didn't play any video games or use FB during that time but I did watch You Tube and used other apps that would have killed the battery on my S2 in less than 3 hours.",
                "review_rating": "4.0 ",
                "review_header": "The Moto G is a significant upgrade over the Galaxy S2",
                "review_comment_count": "",
                "review_author": " Chris Frost",
                "review_posted_date": "24 Mar 2016"
            }
        ]
    },
    {
        "price": "$9.99 - $16.99",
        "ratings": {
            "2 star": "8%",
            "1 star": "10%",
            "5 star": "52%",
            "4 star": "18%",
            "3 star": "12%"
        },
        "url": "http://www.amazon.com/dp/B01AA6P66Q",
        "name": "DEARCASE Women's Long Sleeve Casual Loose T-Shirt Dress",
        "reviews": [
            {
                "review_text": "I just received my dress and I am amazed by it! I'm 5'4\" and 186-188 pounds. I wear a 42C or a 40D bra. Either one works. :) I was terrified but I took a chance and ordered a Large rather than an XL. After reading many reviews I was convinced to at least try the Large. Since it's a Prime item, an exchange or return would be easy anyway. The dress arrived less than an hour ago and it fits perfectly. It is very slimming and can be worn out with friends, church, and most important to me work. The length is just at the knee, maybe 1/2 an inch at the most above it. The asymmetrical cut is interesting in a beautiful way. It does not look like whoever made the dress drank too much coffee and slipped with the scissors one too many times. I'm planning on pairing it with grey knee boots and scarf as in the picture to make the outfit really pop. The material is very soft and although on the thinner side, it's good quality and not see through at all. I hate slips because I live on the GA/SC line and it's Hot! The winters have some colder days but boots, thick boot socks, dress, slip, and a scarf would give me hot flashes! I am investing in boot toppers this year though and now can remove the slip as well. We have a WINNER!!! My husband loves it and said an XL would have been droopy. Curvy girls, this is flattering and hides flaws below the waist. I hope my review is helpful because I rely on them myself when buying clothes. Update as of 3/14/17- I have taken care of these dresses (I have several) and they still look brand new after much wear. They have not shrunk, faded, lost their shape, and there is no pilling. This dress is literally the perfect dress. I stand behind my original review 100%!",
                "review_rating": "5.0 ",
                "review_header": "Great for curvy girls!!!",
                "review_comment_count": "",
                "review_author": " jonieku",
                "review_posted_date": "01 Oct 2016"
            },
            {
                "review_text": "This review is for women over 5'4'' because all the pictures on the review were much shorter than I, so it was hard to compare. I am 5'7'' and usually wear a medium but I almost bought a large to ensure that it would be long enough but I'm sure glad I didn't. It was very flattering and comfortable. I got lots of compliments all day.",
                "review_rating": "5.0 ",
                "review_header": "Long legs/ no problem",
                "review_comment_count": "",
                "review_author": " Amber Lynn Burns",
                "review_posted_date": "19 Oct 2016"
            },
            {
                "review_text": "LOVE this dress! I normally wear an XS/S (5'6\", 135lbs, 32D/34C) but did a M based on customer reviews. I wish I had done a S because it's a little big, but I still love it! Will be buying more colors!",
                "review_rating": "5.0 ",
                "review_header": "IN LOVE!",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "20 Jan 2017"
            },
            {
                "review_text": "I want to order this is ALL THE COLORS. it is so flattering. I am 5'2\" and weight about 190lbs and I ordered a medium. It fits so comfortably and I'm really glad I didn't order a large. If I was around 10-15lbs slimmer it will probably fit even better but it is so comfy and soft and the perfect length. I love how the hem is asymmetrical!!!",
                "review_rating": "5.0 ",
                "review_header": "I want it in every color",
                "review_comment_count": "",
                "review_author": " Emil",
                "review_posted_date": "09 Nov 2016"
            },
            {
                "review_text": "Bought a size medium I'm 5,3 and 136lbs fits great!",
                "review_rating": "5.0 ",
                "review_header": "😊😊😊",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "10 Dec 2016"
            },
            {
                "review_text": "Needed a dress for Christmas pictures and love how soft and comfortable it is.",
                "review_rating": "5.0 ",
                "review_header": "Great dress",
                "review_comment_count": "",
                "review_author": " Andrea Navarro",
                "review_posted_date": "09 Dec 2016"
            },
            {
                "review_text": "Terrible!!! I ordered 2 of these in the same size! The green one came right and fits as expected! The blue one however is WAY too small and way different than the green one! Way too short fits like a shirt instead of a dress! Very disappointed! 😡 They have different tags is the collar too...was supposed to be the same Dress in two different colors!",
                "review_rating": "1.0 ",
                "review_header": "Terrible!!",
                "review_comment_count": "",
                "review_author": " Kendra",
                "review_posted_date": "28 Dec 2016"
            },
            {
                "review_text": "This product is junk. I am a larger woman, the dress fit fine but the scoop at the bottom wasn't in the middle it was on the side, it looked so stupid there was no way I would have worn it in public. It is a thin and cheap material. It also came in a preooened and taped shut bag that it barely fit in. Don't buy it it's a waste of time and money",
                "review_rating": "1.0 ",
                "review_header": "Junk",
                "review_comment_count": "",
                "review_author": " beth",
                "review_posted_date": "22 Nov 2016"
            }
        ]
    },
    {
        "price": "$109.95",
        "ratings": {
            "1 star": "14%",
            "5 star": "69%",
            "4 star": "17%"
        },
        "url": "http://www.amazon.com/dp/B019PCIJQA",
        "name": "Mizuno Women's Wave Sayonara 4 running Shoe",
        "reviews": [
            {
                "review_text": "I've only worn these a few days for an hour or so of running, but so far they are light and flexible, very comfortable, and fit as expected. I used to wear wave-riders and I like these better (I'm a neutral runner), they are lighter and more flexible than the wave-riders but provide more support than my Nike Flyknits.",
                "review_rating": "5.0 ",
                "review_header": "very comfortable, and fit as expected",
                "review_comment_count": "",
                "review_author": " Annie",
                "review_posted_date": "27 Sep 2016"
            },
            {
                "review_text": "Nice, bit I needed to order one size bigger. I should have listened to the reviews.",
                "review_rating": "5.0 ",
                "review_header": "Nice looking shoes",
                "review_comment_count": "",
                "review_author": " LF Trading Compan",
                "review_posted_date": "12 Jun 2017"
            },
            {
                "review_text": "nice colors! I ordered a half size up and they still fit snug. I will be keeping them because they will work and the length works. The shoe is average as far as cushion for walking. Did not purchase for running.",
                "review_rating": "4.0 ",
                "review_header": "Nice vibrant colors!",
                "review_comment_count": "",
                "review_author": " Packer Backer",
                "review_posted_date": "01 Nov 2016"
            },
            {
                "review_text": "Very comfortable. I sized up and they are great a little bit but the smaller size would not have fit. Love the colors!!",
                "review_rating": "4.0 ",
                "review_header": "Great",
                "review_comment_count": "",
                "review_author": " Ashley N Emor",
                "review_posted_date": "07 Oct 2017"
            },
            {
                "review_text": "excellent product",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Johanna Schneider",
                "review_posted_date": "12 Aug 2017"
            },
            {
                "review_text": "most comfortable sneakers ever!",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Kathleen Voigt",
                "review_posted_date": "18 Jun 2017"
            },
            {
                "review_text": "Awesome sneakers! The only ones I run in!",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Irena Ocasio",
                "review_posted_date": "16 May 2017"
            },
            {
                "review_text": "fits a little small",
                "review_rating": "4.0 ",
                "review_header": "Four Stars",
                "review_comment_count": "",
                "review_author": " MA",
                "review_posted_date": "28 Jun 2017"
            }
        ]
    },
    {
        "price": "$48.00",
        "ratings": {
            "5 star": "100%"
        },
        "url": "http://www.amazon.com/dp/B06ZZPR58W",
        "name": "Jessica McClintock Riley Lace Envelope Clutch",
        "reviews": [
            {
                "review_text": "Perfectly perfect.",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Julianne T Mize",
                "review_posted_date": "03 Oct 2017"
            }
        ]
    },
    {
        "price": "$10.12 - $15.58",
        "ratings": {
            "2 star": "8%",
            "1 star": "9%",
            "5 star": "49%",
            "4 star": "21%",
            "3 star": "13%"
        },
        "url": "http://www.amazon.com/dp/B0747BML5G",
        "name": "ZANZEA Women's Sexy Long Batwing Sleeve Loose Pullover Casual Top Blouse T-Shirt",
        "reviews": [
            {
                "review_text": "I want to be perfectly clear on this review. I am reviewing the \"ZANZEA Batwing Sleeve\" shirt. I have found that on amazon, there are an enormous amount of items that use the EXACT same picture that's used on this item. The reviews are significantly different and the color choices are different too. THE PICTURE: It's a blonde, thin woman wearing grey leggings and a white tank under the shirt. The shirt in the image is artificially colored, meaning the same image is used for all of the color choices but the image was altered to show the different colors. The model is not wearing each color. MY REVIEW OF ZANZEA: I love this shirt. I'm short (5'3\") and wear a Large or XL shirt normally. I'm a 38D. I bought this shirt both in XL (2) and in L. The XL was actually a bit large. the L fits perfectly. It covers my butt which means I can wear this with leggings instead of jeggings, although I wear it with both. It's not thin - it is thick but not bulky like a sweater. The bat wings are long and hang down past my wrists. It's super comfortable. I'm tempted to buy one in every color. I might even order a medium - it's that big. I love this shirt. I have it in black, orange and green (which is more of an aquamarine than a kelly green). WHAT ABOUT THE OTHER ITEMS FROM OTHER BRANDS? I have no idea why the picture is identical but the reviews vary GREATLY. the Zanzea seems a big on me but other reviews state the shirt is thin or small and I didn't experience that at all. In an effort to help, I'll post all of the information together. I'll include the brand name, the colors available (not what colors are listed, but the colors I see, which don't really match the description), as well as any conflicting information in the reviews. I hope this helps! Brand: \"Azot\" Colors:Beige, Yellow (problem with the picture), black, aquamarine, purple, grey https://www.amazon.com/Azot-Oversized-Pullover-High-low-Knitwear/dp/B01LRYFWN2/ref=pd_sim_193_8?_encoding=UTF8&psc=1&refRID=0SFQRVDYRQJ69KJA4AB5 Reviews: NONE Brand: \"EXLURA\" Colors: (four colors) https://www.amazon.com/EXLURA-Oversized-Blouse-Batwing-Sleeve/dp/B01LXU2CJP/ref=pd_sbs_193_44?_encoding=UTF8&psc=1&refRID=KR3ERB9NDW7JX9XV6H6S Review: runs very large. Brand: \"Face N Face\" Colors: black, blue, aquamarine, grey, beige, purple, red, pink, white, goldenrod https://www.amazon.com/Womens-Casual-Batwing-Sleeve-Pullover/dp/B01IESZMAM/ref=pd_sim_193_20?_encoding=UTF8&psc=1&refRID=0SFQRVDYRQJ69KJA4AB5 Reviews: Runs very small. Must order at least two sizes up. Thin/see-through. Does not fit like picture. Brand: \"ReachMe\" Colors: maroon (called 'light purple'), beige, grey, dark red, pink, yellow, white, turquoise, black Reviews: smaller than expected Brand: \"Menglihua\" Colors: beige, black, grey, aquamarine, pink, purple, red, white, goldenrod https://www.amazon.com/Menglihua-Womens-Outumn-Oversized-Pullover/dp/B01LRFQ7EE/ref=pd_sim_193_7?_encoding=UTF8&psc=1&refRID=GHCD0Z814PKR5GM39JRM Reviews: Runs extremely small. Sleeves are too short. worst reviews out of all of them. Brand: \"ReachMe\" Colors: maroon (called 'light purple'), beige, grey, dark red, pink, yellow, white, turquoise, black https://www.amazon.com/ReachMe-Womens-Oversized-Off-Shoulder-Pullover/dp/B01M1IS4Q5/ref=pd_sbs_193_5?_encoding=UTF8&psc=1&refRID=SV6144S971PJ67ANH4ED Reviews: smaller than expected Brand: \"Sarin\" Colors: Beigh, black, blue, aquamarine, grey, purple, red, goldenrod https://www.amazon.com/Sarin-Mathews-Oversized-Off-Shoulder-Pullover/dp/B01LXOZWZI/ref=pd_sbs_193_4?_encoding=UTF8&psc=1&refRID=Z8EWRG4M7PTJCN9TV0G6 Reviews: fabric is sheer. Some said larger than expected and others said smaller. Most said larger. Significant discrepancy. Brand: \"Thanth\" Colors: beige, black, blue, dark pink, grey, aquamarine, purple, red, white, goldenrod. https://www.amazon.com/Thanth-Womens-Casual-Shoulder-Pullover/dp/B01M1SFJ5C/ref=pd_sim_193_13?_encoding=UTF8&psc=1&refRID=7FXW3VAZ5Q38HEDA3PXK Reviews: Some say order a size up, others say order one size down. Brand: \"Tinyhi\" Colors: Beige, black, aquamarine, grey, pink, red, white, goldenrod https://www.amazon.com/TINYHI-Womens-Batwing-Pullover-T-Shirt/dp/B01N01CLAC/ref=pd_sim_193_8?_encoding=UTF8&psc=1&refRID=GHCD0Z814PKR5GM39JRM Reviews: No Reviews. Brand: \"Uget\" Colors: beige, black, blue, grey, aquamarine, pink, purple, red, white, goldenrod https://www.amazon.com/Womens-Casual-Oversized-Off-Shoulder-Pullover/dp/B01EFLVU62/ref=pd_sim_193_4?_encoding=UTF8&psc=1&refRID=7FXW3VAZ5Q38HEDA3PXK Reviews: transparent. Loose fitting. Fits larger than expected. Brand: \"Yidarton\" Colors: Beige, black, light seafoam? (it's almost glowing!!!), grey, pink, dark red, white, goldenrod Link: https://www.amazon.com/dp/B01CXZY3O8/ref=twister_B01MTO88I5?_encoding=UTF8&psc=1 Reviews: Thin fabric. Fits larger than expected.",
                "review_rating": "5.0 ",
                "review_header": "I love this booty-covering shirt! MAKE SURE YOU BUY THE RIGHT BRAND...",
                "review_comment_count": "",
                "review_author": " HempHippie",
                "review_posted_date": "24 Nov 2016"
            },
            {
                "review_text": "I'm 5'6, 145 pounds and generally always a medium... I read the reviews, got the medium hoping it wouldn't be too small and actually it's a teeny bit big. It is meant to be roomy so it works, and it's slouchy enough that I can wear it off the shoulder if desired (which I love). The sleeves would be better if they had a bit of elastic at the cuff to shape them but I rolled them up once and that seems to do the job. Received some compliments already. Overall pleased with the purchase, would recommend ordering true to size as this does not skimp on fabric.",
                "review_rating": "4.0 ",
                "review_header": "Like it",
                "review_comment_count": "",
                "review_author": " Brook",
                "review_posted_date": "15 Dec 2016"
            },
            {
                "review_text": "I love this sweater. It is super flowy but still stylish. My only issue with it is that the sleeves are so long, I am 5'5\" for reference. I will probably purchase this in different colors but I would probably buy a smaller size next time.",
                "review_rating": "5.0 ",
                "review_header": "So cute",
                "review_comment_count": "",
                "review_author": " fox",
                "review_posted_date": "25 Sep 2016"
            },
            {
                "review_text": "This is a super cute and comfy slouchy batwing top. What I received was exactly as I had hoped, and looked exactly as pictured online. The one thing I will say is I recommend sizing down one from your normal size. I usually wear a US medium, but after looking at the size chart and seeing the bust is 155 cm (about 61\") on the size small, I knew the medium would be too big if I wanted it like the model. I normally wear a 36DD on top, so 61\" would be more than enough room to still give that loose fit as shown. The material this is made from is a very nice lightweight sweater material so it's very comfy and soft. I like that the neckline is loose enough to be worn off should with a tank layered underneath. The length was perfect. Longer in the back and shorter in the front. In the back it's long enough to cover my butt so can be worn with leggings or skinny jeans for a really cute look. I ordered the blue color which in person looks exactly as shown on my computer. I am very happy with this top in every possible way. Cute style, good fit and nice quality. I wouldn't hesitate to recommend it, just do your measuring first and compare to the size chart to get the fit you expect.",
                "review_rating": "5.0 ",
                "review_header": "Love this cute batwing slouchy top- just size down one",
                "review_comment_count": "",
                "review_author": " AlimondT",
                "review_posted_date": "06 Mar 2017"
            },
            {
                "review_text": "I'm 5'3\" and about 170 lbs. ordered XL and I normally wear large-XL. This is very nice flowy medium thick material. Not see thru. I love the cut on this sweater. It's cut to be oversized but still proportional to your body and true to size.Neatly packaged and I wore it for 3 hours right out of the packaging. Only complaint is that sleeves are kinda big and I rolled them up one time to get them out of my palm. But this is pretty true to the model pic. Hope this was helpful! Update: I ordered a white one also!! Fits exact same as the black. Love this sweater seriously",
                "review_rating": "5.0 ",
                "review_header": "GREAT OVERSIZED SWEATER!!",
                "review_comment_count": "",
                "review_author": " Rachel&Brant",
                "review_posted_date": "23 Nov 2016"
            },
            {
                "review_text": "Before ordering the Zanea shirt, search Amazon for the Uget off-shoulder shirt, the Oyanus, Thanth, Exlura,& Eichatan Konater tops. Notice that Photos for all these tops are exactly the same, and while all are \"oversized\" in design, there are numerous differences even within the same brand name. I purchased 3 Uget tops, but only one is actually an off-shoulder design. Because of the price, and b/c I like the general style, I purchased 9 in the hopes of getting 3 or 4 that I really liked. Some have a deeper cut neckline, some sleeves are waaay long, others shorter, some shirts have seams down the back and on sleeves, others are seamless. Of the nine I've received, 2 are a cotton blend, one is nylon (& not at all \"breathable, as advertised), and the others are a synthetic fabric which causes an itchy rash on my arms. Refer to attached photos(Zanea green/Uget pink) for an idea of what I mean. Zanea has a seam down the back, Uget does not. Zanea has a solid sleeve and it's an inch or two longer. Uget has a pieced sleeve. The Exlura I have in black is Nylon fabric and has 3/4 sleeves. Good Luck.",
                "review_rating": "3.0 ",
                "review_header": "Hope reviews can help in your decision",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "04 Jan 2017"
            }
        ]
    },
    {
        "price": "$7.90 - $19.98",
        "ratings": {
            "2 star": "7%",
            "1 star": "9%",
            "5 star": "57%",
            "4 star": "18%",
            "3 star": "9%"
        },
        "url": "http://www.amazon.com/dp/B01090IMT6",
        "name": "Popular Girl's Cotton Ankle Length Leggings",
        "reviews": [
            {
                "review_text": "Very pleased with these leggings. I purchased the leggings to wear underneath a dress that had gotten too short for my granddaughter. Perfect in every way and the color is exactly as it was pictured to be.",
                "review_rating": "5.0 ",
                "review_header": "Perfect leggings",
                "review_comment_count": "",
                "review_author": " Carole",
                "review_posted_date": "29 Oct 2017"
            },
            {
                "review_text": "I was very satisfied with this item. I got them for my granddaughter. She was very pleased with them. I would order from this seller again.",
                "review_rating": "5.0 ",
                "review_header": "I was very satisfied with this item",
                "review_comment_count": "",
                "review_author": " Coleen Graham",
                "review_posted_date": "13 Mar 2017"
            },
            {
                "review_text": "My daughter is a size 8 and is tall and skinny. These were almost to short. I made them work for her Halloween costume. If I order again in the future I will go up a size.",
                "review_rating": "3.0 ",
                "review_header": "Run Small!",
                "review_comment_count": "",
                "review_author": " Val",
                "review_posted_date": "25 Oct 2017"
            },
            {
                "review_text": "My little girl has to wear school uniform but hates the traditional pants since she does not want to look like a boy. The leggings make her feel good.",
                "review_rating": "5.0 ",
                "review_header": "... traditional pants since she does not want to look like a boy",
                "review_comment_count": "",
                "review_author": " anne west",
                "review_posted_date": "07 Apr 2017"
            },
            {
                "review_text": "Sturdy leggings. They wash well and do not shrink in the dryer. The waste band is comfortable and the material has nice elasticity.",
                "review_rating": "5.0 ",
                "review_header": "Sturdy leggings. They wash well and do not shrink ...",
                "review_comment_count": "",
                "review_author": " Dominique Bridon",
                "review_posted_date": "19 Apr 2017"
            },
            {
                "review_text": "Pants are real flimsy. I thought they would be a little bit thicker.",
                "review_rating": "3.0 ",
                "review_header": "Pants are real flimsy. I thought they would be ...",
                "review_comment_count": "",
                "review_author": " Roxanne G.",
                "review_posted_date": "27 Oct 2017"
            },
            {
                "review_text": "Nice leggings. Nothing special but not disappointing. Color is true.",
                "review_rating": "4.0 ",
                "review_header": "Nice",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "18 Jun 2017"
            },
            {
                "review_text": "My 7 year old daughter loves these pants..this is all she will wear..",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " AmazonCustomerHeatherWilliamson",
                "review_posted_date": "25 Apr 2017"
            }
        ]
    },
    {
        "price": "$9.67 - $17.99",
        "ratings": {
            "2 star": "7%",
            "1 star": "5%",
            "5 star": "62%",
            "4 star": "20%",
            "3 star": "6%"
        },
        "url": "http://www.amazon.com/dp/B01FL2ZMJA",
        "name": "The Children's Place Girls' Bootcut Jeans",
        "reviews": [
            {
                "review_text": "Great quality jeans my girls can wear daily ... have had these for a while and no holes in them yet which means they are tough but also look super cute",
                "review_rating": "4.0 ",
                "review_header": "Great quality jeans my girls can wear daily",
                "review_comment_count": "",
                "review_author": " Kimberly Revis",
                "review_posted_date": "02 Jun 2017"
            },
            {
                "review_text": "Great jeans, well made, got a great​ deal on 2 pairs. Just what I expected from Children's place.",
                "review_rating": "5.0 ",
                "review_header": "Top notch",
                "review_comment_count": "",
                "review_author": " Laura Ross",
                "review_posted_date": "05 Apr 2017"
            },
            {
                "review_text": "Really cute pants that fit well, but arrived with a hole in the butt.... not cool.",
                "review_rating": "2.0 ",
                "review_header": "Already had a hole...",
                "review_comment_count": "",
                "review_author": " A. Reynolds",
                "review_posted_date": "27 Oct 2017"
            },
            {
                "review_text": "Another great product from Children's place. My go to for school clothes!",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Anon",
                "review_posted_date": "29 Aug 2017"
            },
            {
                "review_text": "I love the Children's place jeans for my almost 4 year old. She looks so adorable in them, and live the back pockets. The jeans even have the adjustable waistband on the inside, so if your child is tall and skinny like my daughter they are still a great fit!!",
                "review_rating": "5.0 ",
                "review_header": "Great Children's Jeans to Consider!",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "18 Sep 2016"
            },
            {
                "review_text": "Perfect fit...good quality...she loves them and they look great",
                "review_rating": "5.0 ",
                "review_header": "Perfect",
                "review_comment_count": "",
                "review_author": " Imfairlyamused",
                "review_posted_date": "13 Jul 2017"
            },
            {
                "review_text": "Very nice jeans and true to size. Very happy with them.",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " bm",
                "review_posted_date": "18 Mar 2017"
            },
            {
                "review_text": "its good quality my daughter love them just kind of short they are exactly at her uncle we order 14 slim and now i have orer 16 slim ehe is 14 so... maybe because they are the slim ones... but great",
                "review_rating": "5.0 ",
                "review_header": "its good quality my daughter love them just kind of short ...",
                "review_comment_count": "",
                "review_author": " M.Teresa Rivero",
                "review_posted_date": "06 Oct 2017"
            }
        ]
    },
    {
        "price": "",
        "ratings": {
            "2 star": "3%",
            "1 star": "5%",
            "5 star": "70%",
            "4 star": "15%",
            "3 star": "7%"
        },
        "url": "http://www.amazon.com/dp/B01MZ2WUCA",
        "name": "Joopin-Round Retro Polaroid Sunglasses Driving Polarized Glasses Men Steampunk",
        "reviews": [
            {
                "review_text": "Frames are metal, so you can bend them to fit your face a little better. That's what I had to do since my face is small. Definitely polarized. They make the world look nicer than it really is sometimes. They are great size. Not too giant or too small. I am a petite 25 year old female and they fit my aesthetic well. They are dark and shade my eyes from the sun well. They are a bit flimsy but they arent bad by any means. I went to target to look for some before I bought these and they were more expensive and poorer quality. So I am very happy with my purchase.",
                "review_rating": "5.0 ",
                "review_header": "Grey on grey. Love them.",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "18 Apr 2017"
            },
            {
                "review_text": "Not only are they gorgeous on the outside; but looking out while wearing them makes a gloomy day look brighter and more colorful; as if there is a photo filter built into the lenses. Mine got stolen on the second day I wore mine. They must have fallen off my shirt while I was inside a grocery store. My son in-law said that a young woman behind us in line was wearing something identical, but didn't know mine were missing, and thereby never made the connection. Anyway, after I cussed for a few minutes and experienced a bit of road rage, I went onto the Amazon app on my phone and immediately ordered another pair. Yes, while driving. And yes, they're sooooo worth it. Next payday, I'll probably buy another couple of pairs.",
                "review_rating": "5.0 ",
                "review_header": "Green Blue",
                "review_comment_count": "",
                "review_author": " VERONICA M. PERRY",
                "review_posted_date": "09 Jul 2017"
            },
            {
                "review_text": "These are not cheap, flimsy \"costume\" eyeglasses. They are well made, perfectly designed, and polaroid lenses are the greatest. And the price? You can't do better. I'll be back to check out new products from Joopin.",
                "review_rating": "5.0 ",
                "review_header": "Cool style. Great for driving and for just looking great.",
                "review_comment_count": "",
                "review_author": " Chris Wing",
                "review_posted_date": "06 May 2017"
            },
            {
                "review_text": "Nice design as well as a good amount of free additional accessories (hard case, cloth case and microfiber cloth) The variety of designs are very visually appealing. The only personal issue I had is the quality of the lens does not seem as high as advertised. In any sunlight, it doesn't seem to reduce much glare and still causes heavy strain on the eyes. These glasses look very nice but the practicality is questionable but reasonable for their price point. I would recommend these glasses for anyone looking for a decent, mid-quality pair of sunglasses.",
                "review_rating": "4.0 ",
                "review_header": "Nice design as well as a good amount of free ...",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "05 Aug 2017"
            },
            {
                "review_text": "Absolutely fantastic. They look amazing and everything looks so much clearer. I never realized how crappy my other sunglasses were 😃. The fabric to clean the lenses and the case are really nice and very soft material for the fabric.",
                "review_rating": "5.0 ",
                "review_header": "Worth it",
                "review_comment_count": "",
                "review_author": " Courtney Fullington",
                "review_posted_date": "27 Sep 2017"
            },
            {
                "review_text": "great for a costume, horrible for actual glasses. I tried wearing them outside of a costume setting, they are way too small, and the \"blinders\" on the side are about 3/4 the way to the side of the eye, so you're getting sunlight not matter what. The build is pretty sturdy,",
                "review_rating": "2.0 ",
                "review_header": "great for a costume",
                "review_comment_count": "",
                "review_author": " Addam Carothers",
                "review_posted_date": "31 Oct 2017"
            },
            {
                "review_text": "I shop all the time on a amazon... embarrassed to say I don’t leave many reviews. But my goodness... the glasses are legit. Like all previous reviews mentioned, the quality of these glasses is top notch; they’re sturdy and super clean. They came in a real nice leather/pleather case with a cleaning cloth, polarized test strip and a cool mini screwdriver keychain! I was not expecting anything beyond a box and the glasses, so it was a really nice surprise. Get these while you can!! The flash green rock.. waiting for the black ones to be available to purchase.",
                "review_rating": "5.0 ",
                "review_header": "All the positive reviews are legit! A++!",
                "review_comment_count": "",
                "review_author": " Vanessa",
                "review_posted_date": "16 Oct 2017"
            },
            {
                "review_text": "a really great pair of sunglasses at this price! cool frame, nicely packed (gift box, hard case, soft case, lens cloth, screwdriver). lenses a bit larger than I like (but I like really small lenses) very happy with this purchase!",
                "review_rating": "5.0 ",
                "review_header": "a really great pair of sunglasses at this price!",
                "review_comment_count": "",
                "review_author": " Jonathan Miller",
                "review_posted_date": "30 Oct 2017"
            }
        ]
    },
    {
        "price": "$18.50 - $46.37",
        "ratings": {
            "2 star": "5%",
            "1 star": "7%",
            "5 star": "59%",
            "4 star": "20%",
            "3 star": "9%"
        },
        "url": "http://www.amazon.com/dp/B00IE0S8R0",
        "name": "Van Heusen Men's Poplin Fitted Solid Point Collar Dress Shirt",
        "reviews": [
            {
                "review_text": "I had to buy one of these, regular fit, from a hotel gift shop (for $45) at like 11pm when I had absolutely no shirts for a business event the next day. I then went back to my room and ordered the slim fit from amazon to arrive the next morning. 1. Someone criticized this for being too thin and see-through -- but that's perfectly normal for a poplin shirt, and you see it in ultra-high end shirts like my Yves St. Laurent poplin shirt (I'm talking $300 per shirt). Poplin is a very thin weave, and it's supposed to look silky smooth (compare to broadcloth, oxford etc. which are thick weaves and which look relatively coarse). It's more for summer wear, and works particularly well if you have to wear your suit all day. And yes always wear these with an undershirt (but then again if you're going casual in the summer, no tie and top button open, and you have a good body, then I guess you can just wear it without an undershirt. You see male models pulling off that sort of look). Any way, I can see not liking the shirt. But not liking it because it's too thin and see-through is just off-base. That's what it's supposed to do. 2. But this is not completely perfect. The fit is a little large, so definitely get the fitted (and not normal) and maybe the extra slim if they make that. That being said, I haven't seen what happens to these after 10 washes. 3. The cut is also not super-modern. It's fine though. It's like a normal cut, which you might prefer if you don't want to be too stylish / like a dandy etc. 4. For $20 this is a ridiculous deal.",
                "review_rating": "5.0 ",
                "review_header": "Looks sort of like like my $300 YSL shirts",
                "review_comment_count": "",
                "review_author": " reviewer",
                "review_posted_date": "07 May 2016"
            },
            {
                "review_text": "This shirt looks nice but has a few flaws: 1 - I am not sure how it's considered a slim. It's pretty baggy on me. This might be Fitted at best. 2 - The cuffs are too tight if you wear anything other than the slimmest of watches. My watch actually gets stuck under it at the largest setting. My wrist is 6.25\" which is like a baby's wrist 3 - I am not impressed with the wrinkle resistance so far. Maybe it will improve with a few washings / dryings.",
                "review_rating": "3.0 ",
                "review_header": "Not bad but not great",
                "review_comment_count": "",
                "review_author": " Sheldon Cooper",
                "review_posted_date": "27 Feb 2017"
            },
            {
                "review_text": "The shirt was received looking like a wadded piece of material. I believe the shirt had been unpackaged and then stuffed back into a cellophane bag and not folded. Moreover, I have ordered several shirts similar to this one (same brand) and there were several tags on them that were missing on this shirt. Otherwise, the shirt was ok...at least it was not dirty or stained.",
                "review_rating": "3.0 ",
                "review_header": "Shirt not properly packaged",
                "review_comment_count": "",
                "review_author": " A. A. Jones",
                "review_posted_date": "03 Sep 2017"
            },
            {
                "review_text": "They say fitted but they were not as fitted as we had expected them to be. We bought them based on the size we had previously bought in store but these do not fit like the first set. these are not fitted as is advertised, but look like any other regular shirt. we had to have them adjusted. the material was good though.",
                "review_rating": "3.0 ",
                "review_header": "We bought them based on the size we had previously bought in store but these do not fit like the first set",
                "review_comment_count": "",
                "review_author": " RedPheonix",
                "review_posted_date": "27 Jul 2017"
            },
            {
                "review_text": "For all of us with 18-inch necks, 32/33-inch sleeves, and the need for a fitted shirt, such shirt was all but impossible to find at local stores. It fit well. Similar fit can be obtained by a 17-and-a-half neck-size shirt with stretch-neck technology (also by Van Heusen), 32/33, fitted. It was available through Kohl's deliver-to-store program. I ordered both concurrently to beat a deadline.",
                "review_rating": "5.0 ",
                "review_header": "18-inch Neck, 32/33 sleeves, Fitted Shirt",
                "review_comment_count": "",
                "review_author": " Dann",
                "review_posted_date": "26 Sep 2017"
            },
            {
                "review_text": "Quality of the shirt is fine, but the sizing is inaccurate. I purchased a blue 16.5 fitted and the fit was excellent. I followed up with a red and a white and they were not too close in same fit. About an inch tighter in chest. May come from different manufacturers, so order up a half size to cover their lapse of accurate measurements.",
                "review_rating": "3.0 ",
                "review_header": "Nice quality, but inconsistemt sizing.",
                "review_comment_count": "",
                "review_author": " ryleemax",
                "review_posted_date": "31 Oct 2017"
            },
            {
                "review_text": "didn't work for me. the collar just didn't sit right so i had to return it. it comes with stays in the collar but no slot, so you can't insert your own. so because the collar isn't great, it might have been better with a metal stay insert... but there was no slot to insert one to make it less flimsy.",
                "review_rating": "2.0 ",
                "review_header": "Disappointed in this shirt, especially the collar",
                "review_comment_count": "",
                "review_author": " Joshua of NYC",
                "review_posted_date": "21 Sep 2017"
            },
            {
                "review_text": "I was so happy to find 18 by 32/33 size, unfortunately it's way too baggy on upper body and sleeves. I guess this is mostly a note for myself to stop buying shirts online...",
                "review_rating": "3.0 ",
                "review_header": "I was so happy to find 18 by 32/33 size",
                "review_comment_count": "",
                "review_author": " checkit",
                "review_posted_date": "07 Aug 2017"
            }
        ]
    },
    {
        "price": "$47.48 - $202.11",
        "ratings": {
            "2 star": "5%",
            "1 star": "6%",
            "5 star": "64%",
            "4 star": "18%",
            "3 star": "7%"
        },
        "url": "http://www.amazon.com/dp/B018PEMRXA",
        "name": "Sperry Top-Sider Men's A/O Boat Shoe",
        "reviews": [
            {
                "review_text": "It takes about 10 hours or so to break this pair of shoes in. And they are comfortable once this is done. I personally got another probably 20-30 hours worth of wearing these until they completed started to suck. They are made cheap and the insoles have came unglued and folded up in both shoes. Less than impressed considering the money I spent on these. I received these on April 24th, and haven't even worn them since the end of May.",
                "review_rating": "1.0 ",
                "review_header": "Waste of money",
                "review_comment_count": "",
                "review_author": " Eddie",
                "review_posted_date": "05 Jul 2015"
            },
            {
                "review_text": "A little snug fit but lossening the laces worked. Typically Sperry has many models.if you get their top of the line with their harder feel but higher quality leather the shoe fits perfectly and possibly a tad bigger. I buy Sperry over all other brands but I have to remember they have different boat shoes models that look similar but different quality.",
                "review_rating": "4.0 ",
                "review_header": "Above average but good enough",
                "review_comment_count": "",
                "review_author": " Kungster",
                "review_posted_date": "23 Jul 2017"
            },
            {
                "review_text": "Been wearing these almost exclusively for twenty-plus years. Absolutely love these shoes. Comfortable, goes with many ensembles, comes in wide sizes. Lately, the upper separates from the sole too easily (at or near the toe). Planned obsolescence? Maybe. Seem to recall the upper being sewn to the sole, but no longer. Now they are glued and the glue fails too soon. Nevertheless, these shoes remain awesome. Improvements? Please make the all-black version of this shoe in wide widths.",
                "review_rating": "5.0 ",
                "review_header": "Best shoe ever.",
                "review_comment_count": "",
                "review_author": " Respecthelect",
                "review_posted_date": "05 Apr 2017"
            },
            {
                "review_text": "You can't go wrong with a classic pair of Sperry's. I absolutely love these shoes. They're super comfortable and very casual. I bought the navy blue pair, and that makes the 5th pair of these I own. That definitely testifies to how much I love these shoes!",
                "review_rating": "5.0 ",
                "review_header": "Can't go wrong!",
                "review_comment_count": "",
                "review_author": " Josh",
                "review_posted_date": "20 Sep 2015"
            },
            {
                "review_text": "I work in a hotel , and these shoes were part of our summer uniform , they look good ,but unfortunately they don't feel nearly as good, after maybe 2 hours max , my feet started to hurt , by the end of the day after 8 hour shift , my feet were burning , they have absolutely no arch support and definitely were not made to be worn for longer hours. after suffering from wearing these shoes for about 4 weeks , i asked my manager to get another pair of shoes as i was getting back pains , so i switched to cole haan lunargrand and i couldn't have been happier.",
                "review_rating": "2.0 ",
                "review_header": "Not your comfortable sperry",
                "review_comment_count": "",
                "review_author": " jazzyblus",
                "review_posted_date": "24 Aug 2015"
            },
            {
                "review_text": "I loved my last pair of Sperry's, purchased 6 years ago. They were very comfortable. The new pair I received was deficient in both appearance and comfort. The brown looked dull in comparison, my toes feel squeezed in one of the shoes, and worst of all, I can't walk for more than a few blocks in these before the balls of my feet start hurting. The construction of these shoes just doesn't cut it. I love the boat shoe style, but I can't go out in these shoes anymore. I'd recommend finding a different source of boat shoes if you enjoy pain-free walking.",
                "review_rating": "3.0 ",
                "review_header": "Drop in quality and comfort.",
                "review_comment_count": "",
                "review_author": " Bram Lambrus",
                "review_posted_date": "07 Oct 2016"
            },
            {
                "review_text": "I tried these on in the store (the exact ones) and they fit so comfortably. However, when these arrived from the seller, the soles were completely different and looked as if they have been worn or refurbished! Look was the same (leather was scratched) but the soles were different! Keep in mind that I bought this completely new.",
                "review_rating": "3.0 ",
                "review_header": "... the store (the exact ones) and they fit so comfortably. However",
                "review_comment_count": "",
                "review_author": " Cras",
                "review_posted_date": "05 Sep 2016"
            },
            {
                "review_text": "I've been looking for a good summer shoe since I've been procrastinating on getting a pair. (Before these shoes I only owned thick boots and flip-flops for the last year) I wanted a pair of Sperry's since they are renowned for their quality craftsmanship. On every pair of shoes I've owed I have warn through the back. Sperry's solved this issue by sowing a small overlap in the material which makes it virtually impossible to wear through the backs. They are a slightly more expensive boat shoe than what you could find but the longevity in quality will make up for it. My major concern with this shoe is the fabric in the sole. There is a fabric that overlaps the rest of the sole and has started to curl up in both of my shoes. This can make it very uncomfortable and feels like your sock is riding up if you put your foot in wrong.",
                "review_rating": "4.0 ",
                "review_header": "Decent boat shoe but weird issues with the sole fabric.",
                "review_comment_count": "",
                "review_author": " KYle",
                "review_posted_date": "15 May 2016"
            }
        ]
    },
    {
        "price": "$3.99 - $8.99",
        "ratings": {
            "2 star": "8%",
            "1 star": "6%",
            "5 star": "50%",
            "4 star": "24%",
            "3 star": "12%"
        },
        "url": "http://www.amazon.com/dp/B0153AYBTW",
        "name": "Hanerdun Lace-up Corset Elastic Cinch Belt Waist Belt Three Sizes",
        "reviews": [
            {
                "review_text": "I am really glad I made this purchase. I thought the sides would curl because of its elastic, but it doesn't. the quality is ok and for the money, definitely a win. I have worn it several times and still going strong (no rips or tears). Just to let you know that the back has a velcro strip that holds it together and ...boy does it hold. One more thing about the velcro... if not properly overlapped can irritate any skin it rubs up against. So keep that in mind if you are wearing it with jeans or a skirt with any top that doesn't fit into them (aka crop tops) You really can't be it for the cost. just make sure to size it right, that will be the only problem. I am 5'2 and 110lbs and it fits perfect. As in if it was 1/2 inch smaller, it would be too small or those strings would have had to come undone. I say it's WORTH IT!",
                "review_rating": "4.0 ",
                "review_header": "Worth it!",
                "review_comment_count": "",
                "review_author": " Peach",
                "review_posted_date": "26 Oct 2017"
            },
            {
                "review_text": "The belt came fitting exactly how I thought it would using the sizing chart and ordering the size for my measurements. For the price, this is a really nice belt. It looks just like pictured. I don't like any belt elastic showing so I'm going to make a lace sleeve for each side so the elastic doesn't show. After wearing it in a warm environment it didn't stretch out in any real way, just as one would expect with elastic. And that wasn't too much. Love it!",
                "review_rating": "5.0 ",
                "review_header": "Great looking belt especially for the price!",
                "review_comment_count": "",
                "review_author": " Jenn",
                "review_posted_date": "19 Oct 2017"
            },
            {
                "review_text": "I have mixed feelings about this. I have a 39\" waist so I ordered the XL. It was tight enough to give me a defined waist without rolling or pulling. I decided if it was good as it came, it would be better if I loosened the laces to give myself a tiny bit more space. Sadly, that ruined it. I didn't unlace it completely, just loosened it slightly and after that the fit was terrible. It rolled and bunched and I didn't end up using it. It's true to size, but if you order it I would highly advise against altering it in any way. Maybe adding another Velcro panel would work, but don't do anything to the laces.",
                "review_rating": "3.0 ",
                "review_header": "I decided if it was good as it came",
                "review_comment_count": "",
                "review_author": " Desiree",
                "review_posted_date": "30 Oct 2017"
            },
            {
                "review_text": "I am in luuuuuuuuuuurve with this cincher! Based on the size chart, I ordered an L, but ended up returning it for an XL (which fits perfectly), so I'd say ignore the size chart and buy what you normally wear in shirts. The construction is solid, and the cincher is beautiful. It does have velcro in the back, which I was concerned about what with the stretching and the holding-in and all, but it's very good velcro that not only holds tight, it disappears within the closure and you can't even see it. Great for cosplay, great for Ren faires, honestly, especially for the price, probably do yourself a favor and buy one just to have around.",
                "review_rating": "5.0 ",
                "review_header": "It's PERFECT, Y'all",
                "review_comment_count": "",
                "review_author": " RavenMcCo",
                "review_posted_date": "25 Oct 2017"
            },
            {
                "review_text": "Quality was great, the velcro is super good quality which is perfect because it was kind of tight. i bought it to use as part of a homemade bellatrix costume for my pre-teen. it was almost too tight so i was worried it might keep coming unattached but it held up for what i needed it for. Just remember to size up because other than that it was pefect for the price",
                "review_rating": "4.0 ",
                "review_header": "Quality was great, the velcro is super good quality which is ...",
                "review_comment_count": "",
                "review_author": " melissa",
                "review_posted_date": "01 Nov 2017"
            },
            {
                "review_text": "Definitely a costume piece, not functional. I like it, especially for the price. I'm bigger in the waist and it did want to bunch up and wrinkled after sitting for a while. Does not hold anything in, just for looks.",
                "review_rating": "4.0 ",
                "review_header": "Good for costumes",
                "review_comment_count": "",
                "review_author": " Jessi D.",
                "review_posted_date": "18 Oct 2017"
            },
            {
                "review_text": "I got the large and it was pretty tight... after a few hours it began to bend/roll a bit but for the most part it looked good considering the price.",
                "review_rating": "3.0 ",
                "review_header": "I got the large and it was pretty tight.",
                "review_comment_count": "",
                "review_author": " Caro",
                "review_posted_date": "26 Apr 2017"
            },
            {
                "review_text": "Looks fantastic with pirate or wench costume. Very comfortable and easy to put on with Velcro in back. Highly recommend. I'm 160 lbs 5'4' and ordered a large. Fits extremely well.",
                "review_rating": "5.0 ",
                "review_header": "Looks fantastic with pirate or wench costume",
                "review_comment_count": "",
                "review_author": " Rosie",
                "review_posted_date": "03 Nov 2017"
            }
        ]
    },
    {
        "price": "$29.99",
        "ratings": {
            "2 star": "1%",
            "1 star": "1%",
            "5 star": "81%",
            "4 star": "13%",
            "3 star": "4%"
        },
        "url": "http://www.amazon.com/dp/B0079Q5XTG",
        "name": "Skip Hop Zoo Little Kid Luggage, Monkey",
        "reviews": [
            {
                "review_text": "I found in annoying that other reviews made this product seem so small. If I had realized how roomy this luggage actually was, I would have bought the ladybug one for my daughter who is about to turn 8. I bought the monkey luggage for my 9 month old son for an 8 day trip and this has more than enough room. *edited* To be specific I fit: (sizes between 6 months to 12 months) 16 onsies both short and long sleeved 2 shirts 10 pairs of pants 1 sweater 1 hoodie 1 footsie pyjama 2 burp cloths 1 fleece body suite 6 pairs of socks A hooded baby bath towel (the thick kind) 12 bandana bibs And 14 size 4 diapers (in the front pocket) The picture included is of this luggage fully packed with everything I just mentioned.",
                "review_rating": "5.0 ",
                "review_header": "Very roomy!",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "16 Feb 2015"
            },
            {
                "review_text": "I bought 2 for my boys (17 months and 4 1/2 yrs old) for our trips to visit family out of state. We go several times a year and I have always put their clothes in a huge bag with mine or used one bag for them to share which would lead to the 4 year old digging for his clothes and mixing them all up. I wanted them to have their own bags from now on, especially for the 4 year old because he now packs his won clothes (using a checklist of pictures) and then he can get himself dressed on the trip without mixing up his clothes with his brother's. Note that this is about the size of a regular/adult size backpack with wheels and handle. It's not really a luggage or suitcase per se. How much can you fit? For the 4 year old, I was able to fit a week's worth of clothes in the summer - 7 tops, 7 shorts, 7 underwear, 7 socks, 3 pajamas to wear twice each, and swim shorts. I wash all the laundry on the 6th day if we stay a week or more. In colder weather it will be less that fits in here due to the clothes being bigger. I used it in the fall and was able to fit about 4-5 long sleeve shirts and 2 short sleeve shirts, 5-6 pants, 7 underwear, 7 socks, and 3 pajamas. For the 17 month old, I was able to fit a week's worth of clothes for both the summer and fall trip, with room for 2 aden and anais muslin swaddle blankets (he uses as his bedtime blankies) and an Ikea Spoka nightlight with the charger. I think I also had an extra outfit for him just in case. Also, I put the diapers and wipes in my bag, there's no way to fit a week of those in here with clothes. It pushes the bag to it's limits for a full week trip, but anything less than that and you would gain some room for a toy or books. We bought the little matching backpacks for them to pack toys and books in though and that works for us. Granted, its 2 more bags to carry, pack in the car, and keep track of however then the toys and books are more portable to take around and they don't have to dig in the luggage for those items. Usually the luggage is upstairs in the guest room and the backpack is downstairs in the living room, so it makes sense for our trips.",
                "review_rating": "5.0 ",
                "review_header": "Great overnight bag for kids - just note that it is the size of a standard backpack though",
                "review_comment_count": "",
                "review_author": " Legomom",
                "review_posted_date": "15 Nov 2013"
            },
            {
                "review_text": "Love this suitcase for my toddler son. I have used it several times for weekend getaways and it's perfect. I fit about 6 outfits and his toiletry bag. The front pocket is big enough to fit a couple pairs of shoes.",
                "review_rating": "5.0 ",
                "review_header": "Love this suitcase for my toddler son",
                "review_comment_count": "",
                "review_author": " Bere33",
                "review_posted_date": "01 Dec 2015"
            },
            {
                "review_text": "The cutest little rolling backpack/luggage. We use this for travel for our youngest child. It is very cute and stands out because of the bright colors. We can fit a weeks worth of clothing (for a small child) with extras like a pair of shoes, hairbrush etc. Zippers work wonderful, and it rolls smoothly on the ground. I like that it's not too big that my 3 year old can't pull it on her own. She really feels independent while pulling her own luggage, plus it gives her a job to do, which makes her feel important.",
                "review_rating": "5.0 ",
                "review_header": "Love Skip Hop!",
                "review_comment_count": "",
                "review_author": " S. Allen",
                "review_posted_date": "02 May 2017"
            },
            {
                "review_text": "I wanted to love this item when my 4 year old took it as a suitcase for a international trip. Its strong and cute and recognizable and everything we needed fit in it. Here is why I am going it less then 5 stars. when we were rushed at the airport and needed to move quickly, the handle was not long enough for an adult to use the rollers. We ended up carrying it by the red handle, a bit inconvenient. When my 4 year old rolled it, it kept tipping over, which meant we had to stop moving and put it back in a standing position, after a couple of times of this it got old. Problem could be solved by having 4 wheels instead of 2. That thing in the back for parents to put over their shoulder we never used. That might have been a missed opportunity, but it wasn't adjusted to our size and there wasn't time.",
                "review_rating": "4.0 ",
                "review_header": "Adjust the parent strap in the back before you leave.",
                "review_comment_count": "",
                "review_author": " P. Wu",
                "review_posted_date": "05 Apr 2017"
            },
            {
                "review_text": "The Travel bag is not sturdy at all, more so when compared to the price one is paying for the bag. I purchased it for domestic trips with my 3 year old, and after very first use, I noticed there was a small hole at the lower right corner of the bag. That part was probably touching the ground as one was rolling the bag, and the material gave way at the very first use. Very disappointed at the poor quality of the product, it is just like a use and throw bag. Will not recommend to anybody for the price quoted.",
                "review_rating": "1.0 ",
                "review_header": "The Travel bag is not sturdy at all",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "08 Dec 2016"
            },
            {
                "review_text": "Our son loves (LOVES) it. I find it annoying. He loves to roll it at airports and around the house. But on trips he gets tired and then job falls to me. The handle is too short for it to be comfortable for an adult to roll, and the strap that is meant for adults to use often ends up dragging on the ground or when I do have it across my chest I find the handle mechanism digging into my back... There must be a way to make this nicer. Having said that the kid is happy.",
                "review_rating": "3.0 ",
                "review_header": "Our son loves it. I find it annoying",
                "review_comment_count": "",
                "review_author": " Greyman",
                "review_posted_date": "19 Sep 2014"
            },
            {
                "review_text": "We bought this suitcase and the matching owl backpack with leash to take our kids (almost 3 and 5) to NYC, and it was perfect! It held enough clothes for both kids for a 5 days 4 nights stay, including plenty of extra changes of clothes. The mesh pocket on the side came in handy. My only complaint is that I wish you could make the handle even longer for the inevitable time when the kids tire of pulling it and mom or dad has to take over. We ended up carrying it by the fabric handle when that happened.",
                "review_rating": "5.0 ",
                "review_header": "and it was perfect! It held enough clothes for both kids for ...",
                "review_comment_count": "",
                "review_author": " Jessica M",
                "review_posted_date": "02 Jun 2017"
            }
        ]
    },
    {
        "price": "$31.29",
        "ratings": {
            "2 star": "7%",
            "1 star": "10%",
            "5 star": "62%",
            "4 star": "12%",
            "3 star": "9%"
        },
        "url": "http://www.amazon.com/dp/B00MFNN21E",
        "name": "kate spade new york Small Square Stud Earrings",
        "reviews": [
            {
                "review_text": "Kate Spade accessories always make a style statement. And these oversized Kate studs did exactly that. I was pleased with the size, weight, and overall aesthetic of the earrings. -- With the multi glitter and gold tone metal these studs scream chic! -- The stem of these earings is appropriately sized so it doesn't poke in the back of my ear. -- Check my pics to see how they arrive, they are made in China and they just come in a pouch and ziplock bag. Don't hope for fancy packaging -- And it is 'HUGE' don't think it is Small reading the title. Check the pic. Overall I like the stud but since it is really huge, I wish it was a little smaller.",
                "review_rating": "4.0 ",
                "review_header": "HUGE- earring, no way small square. But beautiful glitter stud!!",
                "review_comment_count": "",
                "review_author": " Richa",
                "review_posted_date": "03 Feb 2016"
            },
            {
                "review_text": "I love all things gold. And big. I usually go for dangly, but these were a good price and too cute to pass up. They look nice, just as pictured. However, the posts were extremely bent. I would not pay full price for these as they are rather costume-y and not really worth that much, but they are really fun and worthwhile on sale =)",
                "review_rating": "4.0 ",
                "review_header": "fun statement earrings",
                "review_comment_count": "",
                "review_author": " Lisa",
                "review_posted_date": "02 Nov 2017"
            },
            {
                "review_text": "Love, love, love these earrings! They are on the larger side. But, I prefer larger earrings.",
                "review_rating": "5.0 ",
                "review_header": "New favorite earrings!",
                "review_comment_count": "",
                "review_author": " Steph",
                "review_posted_date": "05 Feb 2016"
            },
            {
                "review_text": "Love these earrings. Saw them at a local department store, but they didn't have the small ones. Found them on Amazon for $20 less. 😊",
                "review_rating": "5.0 ",
                "review_header": "Love these earrings",
                "review_comment_count": "",
                "review_author": " Sherry Lane",
                "review_posted_date": "10 Apr 2017"
            },
            {
                "review_text": "Love the earings; however, the packaging must have been inappropriate since the stick at the back of one of the earings was bended... everything else good.",
                "review_rating": "3.0 ",
                "review_header": "Love the earings",
                "review_comment_count": "",
                "review_author": " Letz87",
                "review_posted_date": "22 Jul 2017"
            },
            {
                "review_text": "So pretty!!",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " keri08",
                "review_posted_date": "22 Mar 2017"
            },
            {
                "review_text": "Super pretty!",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Kimberly S.",
                "review_posted_date": "07 Mar 2017"
            },
            {
                "review_text": "Nice size however the multicoloured sparkle do not appear refined. Basically does not look the price which is unfortunate because usually Kate Spade does well with jewelry.",
                "review_rating": "3.0 ",
                "review_header": "Wanted to like them...",
                "review_comment_count": "",
                "review_author": " Mynt&Coco",
                "review_posted_date": "13 Apr 2017"
            }
        ]
    },
    {
        "price": "$295.00",
        "ratings": {
            "1 star": "33%",
            "5 star": "33%",
            "4 star": "17%",
            "3 star": "17%"
        },
        "url": "http://www.amazon.com/dp/B01LZKLMNA",
        "name": "ZAC Zac Posen EARTHA ICONIC TOP HANDLE MINI BLACK",
        "reviews": [
            {
                "review_text": "My Sister is going to be so Happy when she opens this at Mother's Day brunch 💝 It's so dainty and so well made !!! Even has pegs on the bottom so your pretty bag never touches the floors 💕🌸💕 Very pleased 💕🌸💕",
                "review_rating": "5.0 ",
                "review_header": "My Sister is going to be so Happy when she opens this at Mother's Day brunch 💝 ...",
                "review_comment_count": "",
                "review_author": " Lynn L.",
                "review_posted_date": "12 May 2017"
            },
            {
                "review_text": "Lovely handbag.",
                "review_rating": "3.0 ",
                "review_header": "Three Stars",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "19 Oct 2017"
            },
            {
                "review_text": "I absolutely love this mini bag! It is perfect for my needs and so different from anything I have purchased previously. I get so many compliments!",
                "review_rating": "5.0 ",
                "review_header": "The pearl covered mini bag is beautiful and a real pleasure to use with all of my outfits! I love it!",
                "review_comment_count": "",
                "review_author": " Bonnie Hollingsworth",
                "review_posted_date": "17 Aug 2017"
            },
            {
                "review_text": "I love this little cutie bag. I",
                "review_rating": "4.0 ",
                "review_header": "Four Stars",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "25 Jun 2017"
            },
            {
                "review_text": "It's very small and does not look like leather",
                "review_rating": "1.0 ",
                "review_header": "One Star",
                "review_comment_count": "",
                "review_author": " Fernando",
                "review_posted_date": "10 Jun 2017"
            },
            {
                "review_text": "Nice look but way too small for any use. Too expensive to put nothing in it. End up returning it.",
                "review_rating": "1.0 ",
                "review_header": "Too small",
                "review_comment_count": "",
                "review_author": " D.C.",
                "review_posted_date": "15 Jun 2017"
            }
        ]
    },
    {
        "price": "$6.24",
        "ratings": {
            "2 star": "4%",
            "1 star": "5%",
            "5 star": "64%",
            "4 star": "17%",
            "3 star": "10%"
        },
        "url": "http://www.amazon.com/dp/B000H6HA96",
        "name": "Duncan Yo Yo Trick Book",
        "reviews": [
            {
                "review_text": "Decent book to get your yo-you skills going. I'd recommend this to anyone who wants to get started with tricks. Depending on your yo-yo some of these may be hard or impossible. If the yo-yo string can't slip at all when unwound then you'll have difficulty. This is perfectly paired with something like the Duncan Pulse Yo Yo.",
                "review_rating": "3.0 ",
                "review_header": "Great book if you have the right Yo-Yo",
                "review_comment_count": "",
                "review_author": " Cyber Wiz",
                "review_posted_date": "09 Jun 2016"
            },
            {
                "review_text": "I bought this along with a Duncan yo- yo for my boyfriend. We hadn't had a yo- yo since we were little. It was fun trying all of the tricks in this book.",
                "review_rating": "5.0 ",
                "review_header": "It was fun trying all of the tricks in this book",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "06 Jan 2017"
            },
            {
                "review_text": "My son wanted a book on Yo-yo tricks... thank goodness Santa came trough! I love the clear directions this book gives you, even if they are hard to execute (read operator error here!)",
                "review_rating": "5.0 ",
                "review_header": "A+ book of tricks!",
                "review_comment_count": "",
                "review_author": " Clark's R Us",
                "review_posted_date": "10 Nov 2015"
            },
            {
                "review_text": "I bought this yo-yo trick book along with a Velocity Yo-Yo(also reviewed) for my nine year old son. He really liked the book and found that it was easy for him to understand. He was able to learn several tricks in a short period of time.",
                "review_rating": "4.0 ",
                "review_header": "Tricks, tricks, and more tricks",
                "review_comment_count": "",
                "review_author": " arkmitch",
                "review_posted_date": "06 Jun 2014"
            },
            {
                "review_text": "Son had lots of fun working on the tricks.",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Lauren B.",
                "review_posted_date": "28 Mar 2017"
            },
            {
                "review_text": "Awesome book",
                "review_rating": "5.0 ",
                "review_header": "Just like it says",
                "review_comment_count": "",
                "review_author": " Dave",
                "review_posted_date": "14 Jun 2017"
            },
            {
                "review_text": "As expected",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Andrea",
                "review_posted_date": "01 Jul 2017"
            },
            {
                "review_text": "Awesome",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Sandy Greenwell",
                "review_posted_date": "31 Jul 2017"
            }
        ]
    },
    {
        "price": "$16.99",
        "ratings": {
            "5 star": "100%"
        },
        "url": "http://www.amazon.com/dp/B073CXRFR7",
        "name": "If You Can Read This Book Lovers Novel Reading Funny T shirt",
        "reviews": [
            {
                "review_text": "I bought this as a gift for my niece's bday, she and i both are introverts and love to read. I'm pretty sure she'll love it.",
                "review_rating": "5.0 ",
                "review_header": "most awesome shirt",
                "review_comment_count": "",
                "review_author": " Angel Vanatter",
                "review_posted_date": "23 Aug 2017"
            }
        ]
    },
    {
        "price": "$64.99 - $139.00",
        "ratings": {
            "4 star": "100%"
        },
        "url": "http://www.amazon.com/dp/B071S37HZJ",
        "name": "Nine West Women's Hollie Leather Ankle Boot",
        "reviews": [
            {
                "review_text": "These boots are classic, sexy but comfortable. For me they run almost half a size large. Not a dealbreaker since I use really thick socks between fall, winter through NYC Spring. I usually wear a US size 6 but could have ordered a US size 5.5. They arrived in perfect condition. Really like them!",
                "review_rating": "4.0 ",
                "review_header": "Four Stars",
                "review_comment_count": "",
                "review_author": " R. L. Bande",
                "review_posted_date": "25 Oct 2017"
            }
        ]
    },
    {
        "price": "$4.90 - $11.99",
        "ratings": {
            "5 star": "87%",
            "4 star": "8%",
            "3 star": "5%"
        },
        "url": "http://www.amazon.com/dp/B01NBSK20Y",
        "name": "HzCodelo Kids Toddler Big Little Girls Fashion Cotton Crew Seamless Socks -5 Pairs",
        "reviews": [
            {
                "review_text": "These are cute socks and seem to be of good quality, but I don't understand how anyone thinks they're good for kids with sensitivity issues. They have strings on the inside as well as a seam with loose strings/bumps on the toe. They did not pass the test with my sensitive girl.",
                "review_rating": "3.0 ",
                "review_header": "These are cute socks and seem to be of good quality, but I don't understand how anyone thinks ...",
                "review_comment_count": "",
                "review_author": " SCS925",
                "review_posted_date": "30 Jul 2017"
            },
            {
                "review_text": "These are the cutest socks. They seem to be good quality too. My 4 year old daughter loves them and shows them off to everyone. They are also good height for her small boots. I wish they made bigger ones for me.",
                "review_rating": "5.0 ",
                "review_header": "They seem to be good quality too",
                "review_comment_count": "",
                "review_author": " K.R.",
                "review_posted_date": "13 Oct 2017"
            },
            {
                "review_text": "These socks are awesome quality! I was pleasantly surprised! They are thicker and nicer than something I would buy at Target.",
                "review_rating": "5.0 ",
                "review_header": "Awesome quality!",
                "review_comment_count": "",
                "review_author": " Teresa",
                "review_posted_date": "15 Oct 2017"
            },
            {
                "review_text": "Love the socks. Super cute and comfy. I actually wear shoes size 10 and they stretch out without problems",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Anica",
                "review_posted_date": "10 Oct 2017"
            },
            {
                "review_text": "They are all very pretty and my granddaughter will love them as her Christmas gift.",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " c. who",
                "review_posted_date": "02 Nov 2017"
            },
            {
                "review_text": "My grand daughter is in kindergarten. She loves wearing these cute socks to school.",
                "review_rating": "5.0 ",
                "review_header": "Cute, well made socks",
                "review_comment_count": "",
                "review_author": " NapaGirl",
                "review_posted_date": "30 Oct 2017"
            },
            {
                "review_text": "My sister loved these for her granddaughters! The kids love the designs.",
                "review_rating": "5.0 ",
                "review_header": "Nice socks!",
                "review_comment_count": "",
                "review_author": " StylishAngie",
                "review_posted_date": "03 Oct 2017"
            },
            {
                "review_text": "Adorable. Fit my 5 year old well, and she likes choosing the animal to wear.",
                "review_rating": "5.0 ",
                "review_header": "Cute for bigger kids",
                "review_comment_count": "",
                "review_author": " Scooter",
                "review_posted_date": "25 Sep 2017"
            }
        ]
    },
    {
        "price": "",
        "ratings": {
            "5 star": "100%"
        },
        "url": "http://www.amazon.com/dp/B00LNRA3V0",
        "name": "Breitling Aerospace Evo Mens Watch E7936310/C869",
        "reviews": [
            {
                "review_text": "The Breitling Aerospace Evo is a watch that I have been promising myself for some time. It turned out to be everything and more than I had wished for in a prestige timepiece such as this. Delivery from the USA to NZ took less than four days so in every respect of this purchase I have been most impressed!",
                "review_rating": "5.0 ",
                "review_header": "Better than anticipated",
                "review_comment_count": "",
                "review_author": " James J Craig",
                "review_posted_date": "16 Feb 2015"
            }
        ]
    },
    {
        "price": "$53.56",
        "ratings": {
            "2 star": "5%",
            "1 star": "8%",
            "5 star": "61%",
            "4 star": "18%",
            "3 star": "8%"
        },
        "url": "http://www.amazon.com/dp/B000GX3ILO",
        "name": "Invicta Women's Mako Pro Diver Quartz 8942",
        "reviews": [
            {
                "review_text": "Good watch, feels comfortable when wearing it, but it is waaaayyyy smaller than I expected, I guess I should read the details better before ordering it, I want it to wear it in the swimming pool, beach and for recreational diving and it looks like it will do the job, took it for a shower and dog bathing and it survived with no issue. Overall I am ok with it, not extremely pleased due to the small size but that is more my fault than theirs, so just make sure you do a better reading than me before ordering and decide if that size is good for you and you will have a nice looking sturdy product.",
                "review_rating": "4.0 ",
                "review_header": "Good watch, feels comfortable when wearing it",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "26 Oct 2015"
            },
            {
                "review_text": "I am quite happy with my make believe Rolex Submariner. I do wish Invicta put as much thought into the Ladies Pro Diver as they did with the mens. This piece does not feature a sweeping second hand which will begin my pursuit of finding a piece for under $300 that does. I am open to suggestions. The bracelet was easy to adjust and the links look heavy even though they are not. The lum on the hands have a green tinge and I have not had the luck of them really glowing in the dark. I was a bit surprised that the bezel rotates, a feature I will not use. Also the magnifier over the date does not magnify the number to its size. This is my first homage watch and I think $50 was a good price.",
                "review_rating": "4.0 ",
                "review_header": "Cheap, stylish watch",
                "review_comment_count": "",
                "review_author": " two tone",
                "review_posted_date": "30 Aug 2014"
            },
            {
                "review_text": "Beautiful and classy. Bought it for my sister and she has large wrists. It fit right on the money with no wiggle room. She said she wished it fit more loosely. I told her it was a watch not a bangle bracelet :) It does not fit her tight it looks amazing.",
                "review_rating": "5.0 ",
                "review_header": "Great!",
                "review_comment_count": "",
                "review_author": " Wilsoniq",
                "review_posted_date": "12 Aug 2017"
            },
            {
                "review_text": "Watches are so personal. Who knows what will strike anyone's fancy. This came pretentiously over-wrapped, and the watch face is so encrusted with logos and funny-shaped hands that it can be hard to read when the little (fat) hand overlaps the logo. The watch is very thick and heavy, and the band would have required removal of a bunch of these big links. So I have no idea if it's really waterproof, but I sent it back. Update... well, whaddaya know, I ended up getting an Invicta watch very similar to this one as a gift, and -- recognizing now as I did not when I wrote the above review -- that huge watches are the IN thing these days, I love it. The one I got is the Invicta Women's 2961 Pro Diver Collection \"Lady Abyss\" Two-Tone Dive Watch, which costs about twice as much as this watch here.",
                "review_rating": "3.0 ",
                "review_header": "Very thick, and a little cheesy looking, but big is in style.",
                "review_comment_count": "",
                "review_author": " Linda Da",
                "review_posted_date": "12 Jan 2014"
            },
            {
                "review_text": "When I ordered this watch I was a little concerned because of mixed reviews. It seemed people either loved this watch or hated it. Pros: Arrived earlier then predicted delivery date, very easy to follow instructions included, accurate pictures/product description, it also looks like an expensive watch without the expensive price tag. I have not tried to test how waterproof this watch is but it seems legit. Cons: To many this may seem like a smaller watch then they expected (aprox. 1 inch diameter watch face) but for me it was fine, the links are a little difficult to adjust to smaller wrist sizes (I tried to adjust it myself and had to bring it to a jeweler). I would give this five stars but having to bring it to a jeweler just to adjust the links threw me off.",
                "review_rating": "4.0 ",
                "review_header": "Excellent Watch!",
                "review_comment_count": "",
                "review_author": " Jam",
                "review_posted_date": "31 Aug 2014"
            },
            {
                "review_text": "I love the look and style of Invicta watches. However they seem to be of very poor quality. I have two of the men's version of this watch and neither will keep correct time anymore and one of them got water inside from the shower. Keep in mind these are supposed to be suitable for diving. These is my third attempt to purchase one for my wife's birthday. Every single one I have received has been defective. The first two the winder would not screw down which is necessary to be water tight. This most recent one when she pulled the winder out to set it 60 seconds after opening the box, the whole thing pulled out of the watch completely. I'm done. I understand a bad item here and there but three in a row? I will not purchase another Invicta watch. Save your money and look elsewhere.",
                "review_rating": "1.0 ",
                "review_header": "Looks great, poor quality. Will be returning",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "09 Oct 2015"
            },
            {
                "review_text": "Beautiful watch, but just too small for me. Face is about the size of a dime. No way to read the date. I'm really disappointed because other than the size, I really like it. Sadly, I'm returning it.",
                "review_rating": "3.0 ",
                "review_header": "Nice watch, but......",
                "review_comment_count": "",
                "review_author": " rr56",
                "review_posted_date": "03 Oct 2017"
            },
            {
                "review_text": "So far I am very pleased with this watch. I have been swimming in a pool, in the ocean, and taken a bath with it on. I did have to take a link out of the watch to help it fit properly. But, I watched a You Tube video and it explained how to take the link out.",
                "review_rating": "5.0 ",
                "review_header": "Pleased with Watch",
                "review_comment_count": "",
                "review_author": " sonyas",
                "review_posted_date": "06 Sep 2015"
            }
        ]
    },
    {
        "price": "$6.42 - $13.99",
        "ratings": {
            "2 star": "8%",
            "1 star": "7%",
            "5 star": "43%",
            "4 star": "27%",
            "3 star": "15%"
        },
        "url": "http://www.amazon.com/dp/B01CDVRZ92",
        "name": "Bluetime Womens Pleated Short Braces Skirt (FBA)",
        "reviews": [
            {
                "review_text": "Super Cute! So cute it even looks great on a guy!",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Iwanna",
                "review_posted_date": "13 May 2016"
            },
            {
                "review_text": "I love this skirt! I think i found my new favorite! I am a bit curvy, so the zipper was a little bit of a hastle, but the cute pearl charm thats on it makes up for that. I highly recomend this skirt! Wear spanx underneath though, it is a bit short. It is an adorable product and well made for its price.",
                "review_rating": "5.0 ",
                "review_header": "I love this skirt",
                "review_comment_count": "",
                "review_author": " danni",
                "review_posted_date": "17 Apr 2015"
            },
            {
                "review_text": "So I was a little worried because I am a plus size girl (waist being 44\" and hips being 50\") but I bought the XL skirt out of pure curiosity since I had money to spare. The skirt, despite my worries, fits surprisingly well! It may be because of the stretchy material for the waist/suspenders but it catered to my body and it isn't too tight or too big. The only complaint that I have is that one of the waist straps is sewn on backwards and all the loose threads but since I'm a seamstress its no big deal to me. zipping the skirt up from the back was difficult so I just put it on over my head without unzipping it. Thank goodness the zipper is strong! I've had plenty of zippers come down or break because of tightness but this one is perfect. Definitely recommend XL size to any plus size women! Be warned, the skirt is a bit short. I'm short myself, only 5'0\" and the skirt barely covers my butt. Maybe an inch past it but maybe adding lace to it or wearing shorts will be fine.",
                "review_rating": "5.0 ",
                "review_header": "plus size review!",
                "review_comment_count": "",
                "review_author": " Jacque",
                "review_posted_date": "23 Dec 2015"
            },
            {
                "review_text": "I ordered this dress in white and I dyed it light pink, added bows, added horse hair on the hem for more poof, and a stripe of lace on the bottom of the skirt! The fit is perfect since there is a great amount of stretch, though I should have ordered a smaller size because it's a little loose. I'm 5'6\" and 31\" waist, 38\" bust/hips so L runs a little loose. It may be cheaply made, but you get what you pay for honestly and I think it's worth it since it can be dyed different colors and altered/modified!",
                "review_rating": "5.0 ",
                "review_header": "Good fit, lots of stretch!",
                "review_comment_count": "",
                "review_author": " Christina Yu",
                "review_posted_date": "10 Feb 2016"
            },
            {
                "review_text": "I was so nervous this was not gonna fit me right and I would have to alter it. But it fits perfect right when I put it on. I got so many compliments 😄 I got a small but I usually get XS cause I'm 5'3, 87 pounds, and my chest being 32A so I thought it feel loose, but it's very form fitting. 👍🏻",
                "review_rating": "5.0 ",
                "review_header": "Fits perfect!",
                "review_comment_count": "",
                "review_author": " Kelse",
                "review_posted_date": "20 May 2015"
            },
            {
                "review_text": "The worst sewing job I've seen. I literally have no words for how poorly this was sewn. There is thread everywhere. Even on the straps seem off.",
                "review_rating": "1.0 ",
                "review_header": "Worst sew job ever.",
                "review_comment_count": "",
                "review_author": " drue",
                "review_posted_date": "22 Jan 2016"
            },
            {
                "review_text": "The skirt fits as I expected, and is made out of nice material. The zipper seems well made on the back, and the material is stretchy. The color is true to the image and I have no complaints. Arrived very quickly, a few weeks before expected arrival date.",
                "review_rating": "5.0 ",
                "review_header": "As advertised!",
                "review_comment_count": "",
                "review_author": " Green",
                "review_posted_date": "03 Jul 2015"
            },
            {
                "review_text": "It would get 5 stars if the length of straps wasn't made for an amazon...its adorable but i had to sew straps up by 6 INCHES to get that \"all girls college\" look i was going for with the hubby... And im 5'3 so i expected it to be a little long but 6 inches? And oh yeah material is EXTREMELY stretchy and bigger than i expected. No need to size UP this one. But Im about to order another as we speak...maybe the straps will be closer to the right length this time though...",
                "review_rating": "4.0 ",
                "review_header": "Are other women 6+feet tall?",
                "review_comment_count": "",
                "review_author": " Tina Hazen",
                "review_posted_date": "01 May 2017"
            }
        ]
    },
    {
        "price": "$12.29",
        "ratings": {
            "2 star": "5%",
            "1 star": "5%",
            "5 star": "71%",
            "4 star": "13%",
            "3 star": "6%"
        },
        "url": "http://www.amazon.com/dp/B01LPKFPNA",
        "name": "DEARCASE Women's Tassels Soft Plaid Tartan Scarf Winter Large Blanket Wrap Shawl",
        "reviews": [
            {
                "review_text": "So I’m not happy. This “beige” is not beige it’s icy light blue. It’s pretty. But unfortunately, not what I ordered. And not what was described. I bought this for a Christmas photo shoot. I was unable to order another color before the shoot took place. Disappointed. Color matters. I read reviews with photos & see someone took a photo of the “beige” one & another had the same complaint I have! I just wish I would have known that they never corrected this issue! I figured the error was fixed by now. :( Please update description if “beige” isn’t beige & change to “light blue”. Inaccuracy is misleading & highly disappointing. I will not buy from this company again! Who knows what you will get! Totally bummed. As I’ll have to wear something else to tie in my family’s clothes together... had hoped this was going to be the piece. It was ESSENTIAL! :’( Think again. Buyer beware do not purchase “beige” unless you want icy light blue instead. There is no beige... :( :( :( I learned the hard way. Sadly. Photos will suffer because of it.",
                "review_rating": "1.0 ",
                "review_header": "Inaccurate Color Description of “Beige” - Buyer Beware!",
                "review_comment_count": "",
                "review_author": " themamabearreview",
                "review_posted_date": "03 Nov 2017"
            },
            {
                "review_text": "Exactly what I was looking for! Very nice quality, soft, and totally worth the price! Received the color I wanted which I struggled with from other sellers. Very happy!",
                "review_rating": "5.0 ",
                "review_header": "Exactly what I wanted!",
                "review_comment_count": "",
                "review_author": " Diamond",
                "review_posted_date": "19 Oct 2017"
            },
            {
                "review_text": "This scarf is very soft and attractive. Excellent quality, price and warm . I would definitely purchase more of this scarf in different colors.",
                "review_rating": "5.0 ",
                "review_header": "Lovely Scarf",
                "review_comment_count": "",
                "review_author": " Livewyr",
                "review_posted_date": "20 Mar 2017"
            },
            {
                "review_text": "Great for keeping this soccer mom warm during outdoor games!. Love the colors and size. Easy wash and wear.",
                "review_rating": "5.0 ",
                "review_header": "A must have!",
                "review_comment_count": "",
                "review_author": " Pen Name",
                "review_posted_date": "03 Jun 2017"
            },
            {
                "review_text": "So warm and soft! I love it. It's a perfect blanket for my lap when I'm at my desk at work too!",
                "review_rating": "5.0 ",
                "review_header": "I love it. It's a perfect blanket for my lap ...",
                "review_comment_count": "",
                "review_author": " Nikki J",
                "review_posted_date": "21 Mar 2017"
            },
            {
                "review_text": "So soft and so comfortable. Blanket scarf so it's quite large and very warm. Love this!",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Amazon Customer--TS",
                "review_posted_date": "25 Mar 2017"
            },
            {
                "review_text": "Bought the green and didn't love the colors. Looked much better in the picture. I returned it.",
                "review_rating": "2.0 ",
                "review_header": "Looks better on your computer screen",
                "review_comment_count": "",
                "review_author": " KellyH.",
                "review_posted_date": "26 Sep 2017"
            },
            {
                "review_text": "Teen is happy with this scarf. Matches multiple solid colour tops and dresses.",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Euro",
                "review_posted_date": "11 Oct 2017"
            }
        ]
    },
    {
        "price": "$14.05 - $39.99",
        "ratings": {
            "2 star": "2%",
            "1 star": "1%",
            "5 star": "77%",
            "4 star": "16%",
            "3 star": "4%"
        },
        "url": "http://www.amazon.com/dp/B01MSN6THW",
        "name": "Columbia Baby Tiny Bear II Bunting",
        "reviews": [
            {
                "review_text": "We put this outfit on our 14 week old for the first time yesterday and went for a stroll. My son looked so stinkin' cute that everyone we passed commented on how much they loved it! We walked for about an hour in 50 degree Seattle weather and my son seemed to be comfortable, after we freed his hands. ;).",
                "review_rating": "5.0 ",
                "review_header": "cutest outfit ever!",
                "review_comment_count": "",
                "review_author": " Laura M. Huddleston",
                "review_posted_date": "11 Feb 2015"
            },
            {
                "review_text": "This is super thin. I realize its a bunting and not a snowsuit but thought itd be a little thicker especially for $30+. Im wondering if it is legit Columbia.It does fit as expected and Ill be keeping it as it will do fine for a baby thatll be too young to play out in the snow anyway. She'll only be outside just to get in the car anyways and buntings are carseat safe whereas snowsuits arent.",
                "review_rating": "4.0 ",
                "review_header": "Columbia bunting",
                "review_comment_count": "",
                "review_author": " Angel's Mom",
                "review_posted_date": "07 Oct 2017"
            },
            {
                "review_text": "Love this! Got the 12-18 month for my 4 month old. He is 27 inches and 18 pounds. He definitely has room to grow. I wanted it to be a bit bigger to last thru winter. I love that the hands and feet have the option to be covered or not. The hood is beyond adorable! Love!",
                "review_rating": "5.0 ",
                "review_header": "Adorable!",
                "review_comment_count": "",
                "review_author": " Hilar",
                "review_posted_date": "31 Oct 2017"
            },
            {
                "review_text": "This was one of the best things I could have purchased for a pretty cold winter. I love how you can cover the baby's hands and feet. My daughter was really warm. The color on the picture is off. It's more of a pink/purple than purple.",
                "review_rating": "5.0 ",
                "review_header": "Beautiful and Warm!",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "16 Mar 2017"
            },
            {
                "review_text": "Love this!!! So easy to put on him! I have the ease of knowing he is nice and warm, without having to come up his legs with blankets when we go out for a walk or running errands. He’s a big 10 month old and ordered a 24 month. It fits perfect cause he’s not walking yet and I can fold both the feet so they are cover and his hands. And it’s super cute with his blue eyes! So happy with this purchase!",
                "review_rating": "5.0 ",
                "review_header": "Happy Momma!!",
                "review_comment_count": "",
                "review_author": " Heather Krause",
                "review_posted_date": "26 Oct 2017"
            },
            {
                "review_text": "My son wears this every day in the winter. It keeps him nice and warm and he looks super cute. He was 8 months when I bought the 12-18months. It was a little big but perfect for layering in the winter. I'm hoping it'll still fit next year too and just pull back the footies.",
                "review_rating": "5.0 ",
                "review_header": "It keeps him nice and warm and he looks super cute",
                "review_comment_count": "",
                "review_author": " Ali J.",
                "review_posted_date": "23 Mar 2017"
            },
            {
                "review_text": "This product is great for babies. My 9month old loves it. She fits properly in her car seat with it on, it's very warm but not bulky like some snowsuits are. I highly recommend it.",
                "review_rating": "5.0 ",
                "review_header": "amazing",
                "review_comment_count": "",
                "review_author": " Brooke",
                "review_posted_date": "05 Dec 2014"
            },
            {
                "review_text": "Niece loved it. Held up after many washes. Great for the price. We kept getting more as she grew, moving up sizes and handed down the old ones to friends with younger babies.",
                "review_rating": "5.0 ",
                "review_header": "Loved these.",
                "review_comment_count": "",
                "review_author": " Rick",
                "review_posted_date": "07 Sep 2017"
            }
        ]
    },
    {
        "price": "$7.49 - $17.49",
        "ratings": {
            "2 star": "4%",
            "1 star": "8%",
            "5 star": "65%",
            "4 star": "15%",
            "3 star": "8%"
        },
        "url": "http://www.amazon.com/dp/B01FYT3HT2",
        "name": "NNJXD Girl Dress Kids Ruffles Lace Party Wedding Dresses",
        "reviews": [
            {
                "review_text": "gorgeous dress, nicely made!!! it's just a little big on my 4 year old but it fits well enough to wear it. seriously a great deal for such a fabulous dress!",
                "review_rating": "5.0 ",
                "review_header": "fabulous dress for a fabulous price",
                "review_comment_count": "",
                "review_author": " Genevieve Carlson",
                "review_posted_date": "30 Sep 2016"
            },
            {
                "review_text": "Couldn't have asked for anything better for the price!! The color is vibrant, the dress is a great length, especially since my daughter is short, and it fit perfectly in the torso for all three girls! ..it needed to be pressed due to being wrinkly from the packaging but otherwise perfect!",
                "review_rating": "5.0 ",
                "review_header": "So worth it!",
                "review_comment_count": "",
                "review_author": " J. Kramer",
                "review_posted_date": "17 Jan 2017"
            },
            {
                "review_text": "Super pleased",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " nairoby torres",
                "review_posted_date": "14 Aug 2016"
            },
            {
                "review_text": "😍",
                "review_rating": "5.0 ",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_author": " Alexis y Johana",
                "review_posted_date": "24 Jan 2017"
            },
            {
                "review_text": "The dress was the right color, but it was a V-neck plunge cut, not straight across like the picture. I had to sew up the front to make it not so deep plunge for my daughter. We also thought it was going to be longer. It barely went to her knees. The ruffles had to be messed with to get them to fall the right way after being packaged up and the little gems were falling off by the end of the night. (She only wore it for 2 hours total). Defiantly would not buy this dress again.",
                "review_rating": "2.0 ",
                "review_header": "Not as pictured.",
                "review_comment_count": "",
                "review_author": " Josh R",
                "review_posted_date": "07 Mar 2017"
            },
            {
                "review_text": "For 15 bucks, this dress is ok. Not quite as pictured. I was expecting multiple layers of tulle and for the dress to flare out more. Instead out was a fairly straight skirt with rings of tulle that were sewn on at even intervals. They did not even overlap so it was awkward looking. Maybe I needed to let the layers puff hoop after being in the bag. Also, the flowers on the top were a completely different shade of purple. Our didn't look horrible, but not like the picture. Sizing was large. My daughter just turned one and fits in 12 months clothes and some 18m. This was 9-12 months and was baggy. Too many reasons for me not to keep it.",
                "review_rating": "3.0 ",
                "review_header": "Not like the pictures.",
                "review_comment_count": "",
                "review_author": " ylime85",
                "review_posted_date": "24 Sep 2017"
            },
            {
                "review_text": "The dress mostly looks like the pictures, except cheaper. I got the red, and it the color matches my computer screen. My daughter weighs 21lbs and is 32 inches tall. I bought the 12-24 month size, and it's a little big on her, but she could wear it. The top part looks fine, it's the bottom that I don't like. The ruffles are made of a very cheap, stiff material. It arrived wrinkled and we're having a difficult time getting the wrinkles out.",
                "review_rating": "3.0 ",
                "review_header": "You get what you pay for",
                "review_comment_count": "",
                "review_author": " Caity C",
                "review_posted_date": "20 Jun 2017"
            },
            {
                "review_text": "Very cute dress, however I both a 3-4yrs my niece is only 2yrs and the bodice is tight. The reason this is getting a 2 star is because of the numerous pin holes in the satin at the bottom that the ruffles are attached to. I don't think that with the ruffles lying flat ( they are up now) that it will be able to hid. DO NOT BUY",
                "review_rating": "2.0 ",
                "review_header": "DISAPPOINTED",
                "review_comment_count": "",
                "review_author": " Kindle Customer",
                "review_posted_date": "30 Nov 2016"
            }
        ]
    },
    {
        "price": "$13.00 - $29.99",
        "ratings": {
            "2 star": "2%",
            "1 star": "2%",
            "5 star": "79%",
            "4 star": "13%",
            "3 star": "4%"
        },
        "url": "http://www.amazon.com/dp/B01JZQVDNM",
        "name": "Zutano Unisex-Baby Newborn Cozie Fleece Bootie",
        "reviews": [
            {
                "review_text": "We didnt get the chance to use these much because live in southern Cali and its usually warm here. I purchased for him to wear on early morning or evening runs but I never went on any runs lol. BUT he has actually been able to wear them recently on a trip to Oregon even though they are a bit small, the fabric is so soft that its like a sock even though its a bit small and doesnt fit perfectly in the length they still work. So I loved that! They are also adorable and incredibly soft. The snap closure is perfect because they are harder for little hands to undo or pull off. And there are two snaps for fitting. I may be purchasing again in a larger size if need be. Definitely recommend. I wish they made them with skidders on the bottom for walking around the house in. I have tried skidders and cant seem to find any that we like",
                "review_rating": "5.0 ",
                "review_header": "Love love!!!",
                "review_comment_count": "",
                "review_author": " emerett",
                "review_posted_date": "27 Jan 2016"
            },
            {
                "review_text": "I was skeptical of how much these cost, because that seemed like a LOT of money to spend on baby footwear for a baby that can't even walk yet... but now we have them and we literally use them every single day. They're so simple to put on and take off (for an adult- the baby can't take them off on her own at all! yea!) and the fact that they're machine washable is awesome. We keep our house a little cooler to save on heating costs so I just put them on over her footie pajama feet and they keep her toasty warm. I am already trying to pick out the next color I'll buy when she outgrows these! Highly recommended!!!",
                "review_rating": "5.0 ",
                "review_header": "Worth every penny!",
                "review_comment_count": "",
                "review_author": " DoU",
                "review_posted_date": "22 Oct 2015"
            },
            {
                "review_text": "I purchased these shoes in a size 12m for my boy. He is currently 7 months and wears size 12m clothing but the 6m shoes he has are a bit big. The 12m fits him perfectly though! They are amazing. I seriously think We'll be purchasing these in many more sizes and colors. Putting shoes on a baby is like trying to put on spanx, nearly impossible. These are super easy. They are a mix between slippers, socks, and shoes. They fit like a dream, are super toasty, and are super easy to put on (like socks). With winter fast approaching, its important to keep the baby tootsies warm and these do an amazing job. Super recommended!",
                "review_rating": "5.0 ",
                "review_header": "The most perfect shoes for babies.",
                "review_comment_count": "",
                "review_author": " Ayla",
                "review_posted_date": "12 Oct 2015"
            },
            {
                "review_text": "I bought these booties to keep baby's feet warm during the winter months. She is not yet walking but she can stand. I find them a bit slippery on some surfaces and find myself wishing they had traction on the bottom. Something to keep in mind if your'e comparing this bootie with others is that most other brands make them with velcro. If you're babe is older, they likely know how to get velcro open. The snaps on Zutano booties ensure that they stay on. My daycare provider actually likes to leave them on all day because they help keep baby's socks on too since she cannot figure out the snaps.",
                "review_rating": "5.0 ",
                "review_header": "Booties with Snaps (snaps are key!)",
                "review_comment_count": "",
                "review_author": " A.R.",
                "review_posted_date": "15 Dec 2016"
            },
            {
                "review_text": "I bought these for my little girl who just turned one last month & who absolutely hates wearing shoes or socks. All I can say is I am kicking myself for not buying these sooner! I bought the hot pink in size 18 months & they fit perfect with a little room to grow. We will at least make it thru the colder months here in California. They stay on well, even when she is trying to rip them off. It also seems like she forgets about them being on more than she does regular socks & I think that may be because they might feel similar to just wearing footie pajamas. They wash well - they don't shrink or ball up & are super soft & cozy feeling. Needless to say, I love these & will be buying a couple more.",
                "review_rating": "5.0 ",
                "review_header": "Buy these! Your baby's cold tootsies will thank you!",
                "review_comment_count": "",
                "review_author": " RQT's Momm",
                "review_posted_date": "27 Jan 2017"
            },
            {
                "review_text": "I love these booties! I got so tired of socks falling off every ten mins so I knew I needed to try something else. These are cute, warm and stay on. I love that they come in so many colors! They also have the two snaps that accommodate smaller and chubbier ankles. The booties do run kind of small. I ordered 6 months for my 12 week old and they fit just right length wise but are pretty loose around her ankles. I have a feeling they won't fit very long, so we'll have to size up soon. I would recommend these booties to any parent sick of fighting to keep socks on and little baby feet warm.",
                "review_rating": "4.0 ",
                "review_header": "Finally something that stays on!",
                "review_comment_count": "",
                "review_author": " michelletmomm",
                "review_posted_date": "02 Jan 2017"
            },
            {
                "review_text": "These booties are great for babies that can't seem me to keep socks on. They are fleece and very warm. The top has two snap options to ensure a snug fit around your baby's ankle. I couldn't tell you how many socks we've lost and these have not once come off. The 6 month size has for my baby from 4 mos, he is now 5 mos and has room to grow so I would say that they are true to size. I purchased the blue color but I wish I would've gotten a color that goes with more outfits, something to keep in mind.",
                "review_rating": "5.0 ",
                "review_header": "No more lost socks",
                "review_comment_count": "",
                "review_author": " Meg R",
                "review_posted_date": "22 Oct 2017"
            },
            {
                "review_text": "We got the 12M size for our 9 month old. They fit pretty well, with just a little bit of space at the toes. We got them for her to wear during the winter since she kicks off anything we put on her feet. These stayed on while she crawled around and played, and even during naps. They're comfortable and perfect to wear with socks underneath. The only downside is that they get a little dirty after a day of crawling around! I have washed them a few times though and they have come out just fine (washer and dryer). I wish they were a little cheaper ($$$), $21 is a bit pricey, but I am satisfied with them for sure.",
                "review_rating": "5.0 ",
                "review_header": "Perfect",
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_posted_date": "14 Jan 2017"
            }
        ]
    }
 
]
